[
  {
    "scrap_id": "i7svzq33",
    "href": "http://www.salon.com/2015/12/11/bret_easton_ellis_goes_on_a_misogynist_rant_to_defend_his_buddy_accused_rapist_james_deen/",
    "description": "Bret Easton Ellis goes on a misogynist rant to defend his buddy, accused rapist James Deen - Salon.com",
    "time": "2015-12-19T23:18:16Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": "The novelist and podcaster thinks he's the guy to defend James Deen."
  },
  {
    "scrap_id": "DdeDEIKl",
    "href": "http://www.vice.com/read/meet-the-artist-behind-the-animorphs-covers-that-destroyed-your-mind-as-a-kid-1207",
    "description": "Meet the Artist Behind the Animorphs Covers That Destroyed Your Mind as a Kid | VICE | United States",
    "time": "2015-12-19T23:03:11Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": "To attend Loscon is to travel from the present to a simpler time, before the ascension of the all-swallowing marketplace-slash-cosplay-orgy that is Comicon."
  },
  {
    "scrap_id": "orcl6B-h",
    "href": "http://www.nytimes.com/2013/11/24/books/review/serious-listening.html?_r=1",
    "description": "www.nytimes.com",
    "time": "2015-12-19T17:03:26Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": "We’re used to it. We audiobook listeners have grown accustomed to the condescending smirks of friends, and even spouses, who believe real reading is something done only with the eyes and paper — or, perhaps, some concede, with a Kindle or other e-reader."
  },
  {
    "scrap_id": "-hyXRHM9",
    "href": "https://www.youtube.com/watch?v=yh7-wAy_8ss",
    "description": ":DRYVRS Ep. 1 \"Just Me In The House By Myself\" starring Macaulay Culkin - YouTube",
    "time": "2015-12-18T22:37:07Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": "Here's the first episode of the new comedy web series :DRYVRS, created and written by musician, actor and producer Jack Dishel. The series stars Jack as an on-demand car service passenger and chronicles the strange drivers he encounters. The debut episode guest stars Macaulay Culkin as his driver.Th"
  },
  {
    "scrap_id": "EVAPyea9",
    "href": "https://www.youtube.com/watch?v=pUNc0C03trk",
    "description": "'Sold Out: The Underground Economy of Supreme Resellers': Full-Length - YouTube",
    "time": "2015-12-18T22:37:06Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": "On Monday, the first part of Sold Out hit the Internet. The subsequent parts rolled out over the rest of the week, but if you've been patiently waiting to take in the entire project in one sitting, your day has come. Above you'll find the full-length cut of Sold Out, with all four parts edited into"
  },
  {
    "scrap_id": "UdBQQrqB",
    "href": "https://news.vice.com/article/this-murder-has-exposed-the-dark-side-of-mexicos-hacking-community",
    "description": "This Murder Has Exposed the Dark Side of Mexico’s Hacking Community | VICE News",
    "time": "2015-12-14T23:59:18Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": "Raúl Robles, a prominent Mexican hacker and cybersecurity expert, was eating breakfast with his father at a quiet café in a leafy neighborhood of the western city of Guadalajara when a masked gunman walked in and opened fire. Robles, 31, was reportedly hit five times and died at the scene."
  },
  {
    "scrap_id": "K_gos6Cu",
    "href": "http://ashleyoutrageous.com/2015/07/a-chat-with-soulection/",
    "description": "AO! | A Chat with Soulection",
    "time": "2015-12-14T04:10:14Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": "Soulection this, Soulection that – If you’ve yet to hear about this crew I’m pretty sure you’ve been sleeping."
  }
]