[
  {
    "scrap_id": "-n143N7g",
    "href": "https://www.youtube.com/watch?v=qFQcvyOTDgk",
    "description": "Watercolour Figures Lesson - Simplifying Figures (Part 2) - YouTube",
    "time": "2018-06-02T15:34:38Z",
    "type": "pinboard",
    "images": [],
    "tags": "watercolor art howto",
    "extended": ""
  },
  {
    "id": 2234105,
    "scrap_id": "VJHJwlG3",
    "href": "https://www.are.na/block/2234105",
    "description": "",
    "time": "2018-05-29T03:30:38.122Z",
    "type": "arena",
    "images": [
      "https://images.are.na/eyJidWNrZXQiOiJhcmVuYV9pbWFnZXMiLCJrZXkiOiIyMjM0MTA1L29yaWdpbmFsXzgzMjFlOWQ4OTNmMDQ4NzllNjRlZjdlMDg2ZjhmMzY5LmpwZyIsImVkaXRzIjp7InJlc2l6ZSI6eyJ3aWR0aCI6MTIwMCwiaGVpZ2h0IjoxMjAwLCJmaXQiOiJpbnNpZGUiLCJ3aXRob3V0RW5sYXJnZW1lbnQiOnRydWV9LCJ3ZWJwIjp7InF1YWxpdHkiOjY1fSwianBlZyI6eyJxdWFsaXR5Ijo2NX0sInJvdGF0ZSI6bnVsbH19?bc=1"
    ]
  },
  {
    "id": 2234105,
    "scrap_id": "VJHJwlG3",
    "href": "https://www.are.na/block/2234105",
    "description": "",
    "time": "2018-05-29T03:30:38.122Z",
    "type": "arena",
    "images": [
      "https://images.are.na/eyJidWNrZXQiOiJhcmVuYV9pbWFnZXMiLCJrZXkiOiIyMjM0MTA1L29yaWdpbmFsXzgzMjFlOWQ4OTNmMDQ4NzllNjRlZjdlMDg2ZjhmMzY5LmpwZyIsImVkaXRzIjp7InJlc2l6ZSI6eyJ3aWR0aCI6MTIwMCwiaGVpZ2h0IjoxMjAwLCJmaXQiOiJpbnNpZGUiLCJ3aXRob3V0RW5sYXJnZW1lbnQiOnRydWV9LCJ3ZWJwIjp7InF1YWxpdHkiOjY1fSwianBlZyI6eyJxdWFsaXR5Ijo2NX0sInJvdGF0ZSI6bnVsbH19?bc=1"
    ]
  },
  {
    "scrap_id": "ASrmNp--",
    "href": "http://classics.mit.edu/Plato/phaedrus.html",
    "description": "The Internet Classics Archive | Phaedrus by Plato",
    "time": "2018-05-27T19:17:12Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": "And so the beloved who, like a god, has received every true and loyal service from his lover, not in pretence but in reality, being also himself of a nature friendly to his admirer, if in former days he has blushed to own his passion and turned away his lover, because his youthful companions or others slanderously told him that he would be disgraced, now as years advance, at the appointed age and time, is led to receive him into communion. For fate which has ordained that there shall be no friendship among the evil has also ordained that there shall ever be friendship among the good. And the beloved when he has received him into communion and intimacy, is quite amazed at the good-will of the lover; he recognises that the inspired friend is worth all other friends or kinsmen; they have nothing of friendship in them worthy to be compared with his. And when his feeling continues and he is nearer to him and embraces him, in gymnastic exercises and at other times of meeting, then the fountain of that stream, which Zeus when he was in love with Ganymede named Desire, overflows upon the lover, and some enters into his soul, and some when he is filled flows out again; and as a breeze or an echo rebounds from the smooth rocks and returns whence it came, so does the stream of beauty, passing through the eyes which are the windows of the soul, come back to the beautiful one; there arriving and quickening the passages of the wings, watering. them and inclining them to grow, and filling the soul of the beloved also with love. And thus he loves, but he knows not what; he does not understand and cannot explain his own state; he appears to have caught the infection of blindness from another; the lover is his mirror in whom he is beholding himself, but he is not aware of this. When he is with the lover, both cease from their pain, but when he is away then he longs as he is longed for, and has love's image, love for love (Anteros) lodging in his breast, which he calls and believes to be not love but friendship only, and his desire is as the desire of the other, but weaker; he wants to see him, touch him, kiss him, embrace him, and probably not long afterwards his desire is accomplished. When they meet, the wanton steed of the lover has a word to say to the charioteer; he would like to have a little pleasure in return for many pains, but the wanton steed of the beloved says not a word, for he is bursting with passion which he understands not;-he throws his arms round the lover and embraces him as his dearest friend; and, when they are side by side, he is not in it state in which he can refuse the lover anything, if he ask him; although his fellow-steed and the charioteer oppose him with the arguments of shame and reason. "
  },
  {
    "scrap_id": "OVG9pnrc",
    "href": "https://beta.observablehq.com/@mbostock/introduction-to-generators",
    "description": "Introduction to Generators / Observable",
    "time": "2018-05-27T03:19:40Z",
    "type": "pinboard",
    "images": [],
    "tags": "d3 code",
    "extended": ""
  }
]