[
  {
    "scrap_id": "vJn3NPM8",
    "href": "https://www.youtube.com/watch?v=gwo9jY4ccB4",
    "description": "PICO-8 Audio: Music Editor",
    "time": "2019-01-05T00:42:42Z",
    "type": "pinboard",
    "images": [],
    "tags": "pico8 music howto",
    "extended": "How to use the music editor in the PICO-8 fantasy console"
  },
  {
    "scrap_id": "jRCxIjAR",
    "href": "https://www.wired.com/story/how-blockchain-can-wrest-the-internet-from-corporations/",
    "description": "Blockchain Can Wrest the Internet From Corporations' Grasp | WIRED",
    "time": "2019-01-04T18:44:41Z",
    "type": "pinboard",
    "images": [],
    "tags": "cryptocurrency opensource",
    "extended": "The idea that an internet service could have an associated coin or token may be a novel concept, but the blockchain and cryptocurrencies can do for cloud-based services what open source did for software. It took twenty years for open source software to supplant proprietary software, and it could take just as long for open services to supplant proprietary services. But the benefits of such a shift will be immense. Instead of placing our trust in corporations, we can place our trust in community-owned and -operated software, transforming the internet’s governing principle from “don’t be evil” back to “can’t be evil.”"
  },
  {
    "scrap_id": "ecEiTj72",
    "href": "https://niemanreports.org/articles/the-artistry-of-visual-arts-writing/",
    "description": "Critics and Online Outlets Leading the Vanguard in Arts Writing - Nieman Reports",
    "time": "2019-01-03T00:08:59Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": ""
  },
  {
    "scrap_id": "3Cqvp0zK",
    "href": "https://niemanreports.org/articles/hyperallergic/",
    "description": "Hyperallergic, at Age 9, Rivals the Arts Journalism of Legacy Media - Nieman Reports",
    "time": "2019-01-02T20:10:45Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": ""
  },
  {
    "scrap_id": "CF78IFm2",
    "href": "https://www.newyorker.com/magazine/2015/03/16/girl-interrupted?fbclid=IwAR3xlWXMEW7iCMUgiSFgAzbzJjvLBWPXJf2BrD4-x2YfhEkCY8KFKzsrvz4",
    "description": "How Gay Was Sappho? | The New Yorker",
    "time": "2019-01-02T19:49:00Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": ""
  },
  {
    "scrap_id": "2S60zYBQ",
    "href": "https://www.wired.com/2017/01/how-i-got-my-attention-back/?utm_social-type=owned&mbid=social_twitter&utm_brand=wired",
    "description": "How I Got My Attention Back | WIRED",
    "time": "2019-01-02T05:04:57Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": "In 1992 Bill McKibben “spent many months of forty hour weeks” attempting to watch twenty-four hours of television as recorded on ninety-one cable stations in Virginia (at the time, the most in the world). He wrote up his findings in the book, “The Age of Missing Information.”\r\n\r\n“We believe that we live in the ‘age of information.’” he writes. “That there has been an information ‘explosion,’ an information ‘revolution.’ While in a certain narrow sense this is the case, in many important ways just the opposite is true. We also live at a moment of deep ignorance, when vital knowledge that humans have always possessed about who we are and where we live seems beyond our reach. An Unenlightenment. An age of missing information.”\r\n\r\n...\r\n\r\nBut … I want my attention back.\r\n\r\nDid I really have it before Facebook? Thinking back, the early versions of Facebook were adorable. Benign. No tagging. No timelines. Just The Wall. A way to say — Hey, what’s shaking dorm buddy? Poke. No algorithms. A human scale.\r\n\r\n...\r\n\r\nReturning to those (mythical?) halcyon minimalist information days: You could read all of the news in a single day. Grab the two or three papers and read. The information had edges; it could be understood by a single human over one cup of first-wave coffee. Were you insatiable, the library was available to dig deep on the topics of the day.\r\n\r\nIs this being too reductive? Too rose-tinted?\r\n\r\n...\r\n\r\nAttention is a muscle. It must be exercised. Though, attention is duplicitous — it doesn’t feel like a muscle. And exercising it doesn’t result in an appreciably healthier looking body. But it does result in a sense of grounding, feeling rational, control of your emotions — a healthy mind. Our measuring sticks for life tend to be optimized for material things, things easy to count. Houses, cars, husbands, babies, dollar bills. Attention is immaterial, difficult to track.\r\n\r\nWe deserve our attention."
  },
  {
    "scrap_id": "8MyFp4z-",
    "href": "https://www.npmjs.com/package/dualshock-controller",
    "description": "dualshock-controller - npm",
    "time": "2019-01-01T20:30:54Z",
    "type": "pinboard",
    "images": [],
    "tags": "javascript games",
    "extended": " Eventing API layer over HID for the Sony DualShock 3 and DualShock 4 controllers"
  },
  {
    "scrap_id": "FQhsH41-",
    "href": "https://www.eventbrite.com/e/live-code-lab-tickets-52981770903?aff=ebdsorderfblightbox",
    "description": "Live Code Lab Tickets, Sat, Feb 2, 2019 at 11:30 AM | Eventbrite",
    "time": "2019-01-01T20:28:30Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": ""
  },
  {
    "scrap_id": "YzdPA8eK",
    "href": "https://www.oskitone.com/",
    "description": "3D Printed DIY Synthesizers and Musical Instruments",
    "time": "2019-01-01T20:15:46Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": ""
  },
  {
    "scrap_id": "ykSK2OKe",
    "href": "https://motherboard.vice.com/en_us/article/gyynwm/barrett-brown-what-is-to-be-done",
    "description": "What Is to Be Done? - Motherboard",
    "time": "2019-01-01T19:14:35Z",
    "type": "pinboard",
    "images": [],
    "tags": "",
    "extended": "Ten years later, many now regard the Bush Administration with actual nostalgia.\r\n\r\nAnd 10 years from today, will we look back to 2017 with the same longing?"
  }
]