[
  {
    "id": 5497356,
    "href": "https://www.are.na/block/5497356",
    "description": "Parallel I\nHarun Farocki\n2012 | 00:15:53 | Germany | English | Color | Stereo | 16:9 | HD video\n\nfrom Video Data Bank:\n\nParallel I opens up a history of styles in computer graphics. The first games of the 1980s consisted of only horizontal and vertical lines. This abstraction was seen as a failing, and today representations are oriented towards photo‐realism.\n\n\"For over one hundred years photography and film were the leading media. From the start, they served not only to inform and entertain, but were also media of scientific research and documentation. That’s also why these reproduction techniques were associated with notions of objectivity and contemporaneity -- whereas images created by drawing and painting indicated subjectivity and the transrational.\n\nApparently today computer animation is taking the lead. Our subject is the development and creation of digital animation. If, for example, a forest has to be covered in foliage, the basic genetic growth program will be applied, so that “trees with fresh foliage”, “a forest in which some trees bear four-week-old foliage, others six-week-old foliage” can be created. The more generative algorithms are used, the more the image detaches itself from the appearance as found and becomes an ideal-typical.\n\nUsing the example of trees and bushes, water, fire and clouds we compare the development of surfaces and colourings over the past thirty years in computer animation images. We want to document reality-effects such as reflections, clouds, and smoke in their evolutionary history.\"   \n\n-- Harun Farocki\n\nSource: http://www.vdb.org/titles/parallel-i",
    "time": "2019-11-14T18:26:18.341Z",
    "type": "arena",
    "images": [
      "https://images.are.na/eyJidWNrZXQiOiJhcmVuYV9pbWFnZXMiLCJrZXkiOiI1NDk3MzU2L29yaWdpbmFsXzI1MzliMTlmN2MzYTEzMGRmM2Q0YTRhMjExN2Q4NDg3LmpwZyIsImVkaXRzIjp7InJlc2l6ZSI6eyJ3aWR0aCI6MTIwMCwiaGVpZ2h0IjoxMjAwLCJmaXQiOiJpbnNpZGUiLCJ3aXRob3V0RW5sYXJnZW1lbnQiOnRydWV9LCJ3ZWJwIjp7InF1YWxpdHkiOjY1fSwianBlZyI6eyJxdWFsaXR5Ijo2NX0sInJvdGF0ZSI6bnVsbH19?bc=0"
    ],
    "channel": "🧠 Cyberpunk"
  }
]