{
  "dek": "In which the author proudly lays out his toolkit",
  "type": "words",
  "hidden": false,
  "inprogress": false,
  "date": "2019-03-24T21:19:39-04:00",
  "hidetimestamp": false,
  "bodyContent": "# Computer setup\nI’m a big fan of [preparation](https://ejfox.com/blog/step-zero/). There is some part of my personality that identifies with preppers who assemble “go bags” in case of emergency. It’s the same instinct that made me want to buy a manual transmission for my first car. That way I could be sure I could drive any car I encountered.\n\nMy technological set-up is similar. There are a lot of things in place that one could argue I don’t need right now, or don’t use regularly, or could be done a bit more automatically. \n\nBut it makes me feel better because they are already configured and set up in case I need them, and I can get fine-tuned control when I need it.\n\n> There are about a hundred little tricks like this that Hiro wouldn't know about if he hadn't been programming avatars for people like Vitaly Chernobyl for the last couple of years. To write a really good invisible avatar from scratch would take a long time, but he puts one together in several hours by recycling bits and pieces of old projects left behind in his computer. Which is how hackers usually do it.\n> <cite>Neal Stephenson, Snow Crash, 1992</cite>\n\n[[toc]]\n\n#### Why?\nThe motivations behind doing this are not always clear to me. But in the end it comes from a core belief that computers can allow us to do amazing things. As I discover new pockets of knowledge, I also find new ways to string them together. Occasionally an idea will come to me and I can see how I would put it together because I had already experimented with some of the elements without necessarily even knowing why.\n\nI’ve written a bit about how I believe the [internet was built to be hacked](https://ejfox.com/blog/the-internet-was-built-to-be-hacked) and the tools to do so have been given to us- and they’re pretty well documented!\n\nPart of this exercise has been going back to my roots to understand some of the root technologies (like email, mailing lists, usenet, IRC, PGP, etc.) can be remembered, reused, and repurposed to build a better online world.\n\nI’ve also been watching a lot of Mr. Robot lately and it frankly just feels cool to make computers do what you want by typing the right magic words.\n\n## Passwords & 2FA\n1password is the core of my set up. It allows me to have secure and complicated passwords for all of my accounts / logins / keys / etc. My golden rule lately is that if I can remember my password, it isn’t strong enough.\n\nThe iPhone with Face ID makes opening 1password on-the-go incredibly fast. On the desktop, I open 1password with Alfred, search for the login, and use the “CMD-shift-C” hotkey to copy the password which can be done exclusively from the keyboard relatively quickly.\n\nI use two-factor authentication on every service that offers it. Wherever possible, I [avoid 2FA that uses my phone number](https://authy.com/blog/understanding-2fa-the-authy-app-and-sms/). I really like Authy. The app is designed intelligently and importantly they have planned for the occasion when I upgrade my phone. I recently had to go through the process of removing 2FA from all of my services when I upgraded my iPhone because I was using Google Authenticator which does not support backups. I’m not doing that again.\n\n## Using the command line\nI’ve spent a long time halfway comfortable with the command line. Essentially swimming in shallow water with a `cd` here and and `ls` there. I wanted to take some concentrated time to become more familiar with the command line. The eventual goal would be to be able to sign onto any *nix command line and be able to navigate and get stuff done.\n\nFor now, I’m just focusing on using the command line more in my everyday life. I am finding there are certain tasks I prefer to tackle in different ways, but part of the process is exposing myself to all the different potential tools I could use.\n\n### iTerm hotkey window\nAt any time I can [easily conjure a terminal](https://www.typefloundry.com/1-800-iterm-bling.html) by pressing “cmd-shift-I” which makes it easier to jump in and out of the CLI with basically no friction.\n\n### tmux\nI’m also running [tmux](https://hackernoon.com/a-gentle-introduction-to-tmux-8d784c404340) so creating a new window is a quick “ctrl-a c” and I’m off and running. I’ve also been using “ctrl-a w” which is basically a tmux version of alt-tab and lets me go between my different windows with the arrow keys.\n\n### vim\nI only just started using vim, and it required setting it up *just* right for [my personal setup](https://github.com/ejfox/dotfiles/blob/master/.vimrc “My vim configuration file is hosted on GitHub with the rest of my dotfiles”). I’ve been collecting helpful commands or tools with the [**vim** tag on pinboard](https://pinboard.in/u:ejfox/t:vim)\n- [nerdtree](https://github.com/scrooloose/nerdtree) for a file explorer\n- [fzf](https://github.com/junegunn/fzf#respecting-gitignore-hgignore-and-svnignore) which I’ve remapped to ctrl-p (like Atom) so I can quickly search files in my directory to open\n- [lightline](https://github.com/itchyny/lightline.vim) is a statusline for vim that makes it easy to see what mode I’m in\n\n### cli tools\n- [lazygit](https://github.com/jesseduffield/lazygit) is an amazing tool for doing most git-related tasks easily and sanely without memorizing tons of commands - I use it all the time in combination with vim\n- [mackup](https://github.com/lra/mackup) has been instrumental for me. It allows you to back up your application settings and dotfiles through Dropbox. It lets a lot of my hotkey and app settings stay the same between my personal and work machine without having to set everything up all the time. It also makes it really easy to spin up on new machines/VMs.\n- [jsonfui](https://github.com/AdrianSchneider/jsonfui) is a great CLI interface for JSON data, and a way more performant way of exploring large datasets than loading them into a Atom or a browser and waiting for the prettification. It's also nice to be able to pipe outputs of node scripts to a quick UI.\n- [fd](https://github.com/sharkdp/fd) as a fast alternative to the native `find` command \n- [catimg](https://github.com/posva/catimg) allows you to preview images in the terminal which is pretty rad and marginally useful\n- [mutt](https://medium.com/@stessyco/gmail-from-the-command-line-with-mutt-mac-os-x-92d047bcd74f) lets me send and receive email from the command line which is rad and a nice no-frills interface that makes one feel like a Real Hacker\n- [newsboat](https://github.com/newsboat/newsboat) is like mutt for RSS feeds\n- [recon-ng](https://bitbucket.org/LaNMaSteR53/recon-ng) is a tool used for OSINT research, using a variety of Python scripts and APIs to look up publicly available information for research purposes\n\n## Communicating\nI really love [Keybase](https://keybase.io/)! They make getting started with cryptography really fun. I’ve understood the concepts and methodology of PGP before, and even generated a key and promptly never used it. But Keybase bridged the gap for me.\n\nI now have a [keybase profile](https://keybase.io/ejfox) that lists a handful of verified identities and addresses that are provably me. I am also now hosting my public PGP key at <https://ejfox.com/pgp.txt> so that people who want to send me encrypted messages can do so. It is easy to import with `curl https://ejfox.com/pgp.txt | gpg --import` \n\nIt’s also nice that, even as much as I trust keybase, the PGP key is [hosted on an HTTPS website that I exclusively control](https://jacob.hoffman-andrews.com/README/the-safe-way-to-put-a-pgp-key-in-your-twitter-bio/). \n\nMy key is also hosted in multiple places, so you can confirm my public key [on GitHub](https://github.com/ejfox.gpg) is the same as the one [I host](https://ejfox.com/pgp.txt) which is the same as the one [on Keybase](https://keybase.io/ejfox/pgp_keys.asc).\n\nA semi-automated way to do this comparison is by appending all 3 keys to a txt file and comparing them ^[Or you can just run [this gist](https://gist.github.com/ejfox/d64a7da835ef51ef67c376fdf6d0b542) as a one-liner: `sh -c \"$(curl -fsSL https://gist.githubusercontent.com/ejfox/d64a7da835ef51ef67c376fdf6d0b542/raw/0c5724ab43ea5af6a25d3544e43fcfe75bce8d41/verify-pgp.sh)\"`]. \n```bash\ncurl https://github.com/ejfox.gpg | gpg --with-colons --import-options import-show --dry-run --import >> fp.txt\n\ncurl https://ejfox.com/pgp.txt | gpg --with-colons --import-options import-show --dry-run --import >> fp.txt\n\ncurl https://keybase.io/ejfox/pgp_keys.asc | gpg --with-colons --import-options import-show --dry-run --import >> fp.txt\n\ngrep 89CD fp.txt\n```\n\nWhich should return the same matching fingerprint from all 3 files. ^[If any of my publicly-posted keys (or fingerprints) do not match please [contact me immediately](mailto:ejfox@ejfox.com) because something weird is afoot.]\n```\nfpr:::::::::5D30A33E08E35B8915B4C7E2E2078E653FE389CD:\nfpr:::::::::5D30A33E08E35B8915B4C7E2E2078E653FE389CD:\nfpr:::::::::5D30A33E08E35B8915B4C7E2E2078E653FE389CD:\n```\n\nMy [website is backed up](https://ejfox.keybase.pub/) on the [Keybase filesystem](https://keybase.io/docs/kbfs) as part of my [site’s deploy process](https://github.com/ejfox/website/blob/master/package.json#L14).\n\nI’ve got the [GPG Suite](https://gpgtools.org/) for OS X which makes it so you can store your PGP key passphrase in the keychain. This makes it easier to do a handful of things, including [signing git commits](https://help.github.com/en/articles/signing-commits) with my key without having to enter my passphrase every time.\n\nI’m also using [FlowCrypt](https://flowcrypt.com/) which makes it easy to encrypt and decrypt emails in gmail through a Chrome extension. Like Keybase, it makes something that has been really complicated before really easy and accessible and low-friction.\n\nI wish people still used IRC, but it really doesn’t seem like they do (invite me to your server). I think the future looks a lot less like Slack or Discord and a lot more like an anonymous decentralized encrypted IRC. As far as I can tell, that’s this thing called [matrix](http://matrix.org/).\n\nMatrix even supports [bridging with IRC channels](https://matrix.org/blog/2015/04/22/matrix-irc-application-service/) and I like that kind of backwards compatibility. On the downside, however, it looks like literally no one uses these yet. I’ve been playing around with [riot.im](https://about.riot.im/) as my web/ios matrix client and don’t have many complaints, but I don’t use it that much.\n\n## Surfing the web\nI recently got rid of the internet connection at my apartment. It doesn’t mean I don’t use the internet, but I no longer have the ability to sit around and watch Netflix or play video games online all day. It’s been an experiment that’s been going well- what started as two weeks has stretched to over 2 months.\n\nI’ve been looking into getting rid of my cable connection while I wait for real consumer-facing 5G. In the meantime I’ve been looking into a group called [NYC Mesh](https://www.nycmesh.net/faq#free) who are building a low-cost mesh wifi network across New York City. This ties into a lot of ideas I have about democratizing access to the internet and more general mutual aid.\n\nI’ve been tethering to my iPhone a lot too, which has meant slightly adjusting my internet habits and figuring out ways to reduce my data usage and still get work done and enjoy myself. This adds to my sense of freedom- anywhere I have cell phone service I can do essentially anything.\n\nI’ve been really interested in the work being done with the [Brave Browser](https://brave.com/) especially the [Basic Attention Token](https://basicattentiontoken.org/) which among other things, allows people who browse the web to give money to content publishers through automated microtransactions (which I think is probably the future of healthy content consumption on the internet).\n\n#### VPN\nI really like [NordVPN](https://nordvpn.com/) last time I’d checked they had relatively good reviews from folks I trusted, they are pretty affordable, they take cryptocurrency, and their desktop and iOS apps are actually really nice. I usually have a VPN running on my desktop and phone in addition to the [1.1.1.1](https://itunes.apple.com/us/app/1-1-1-1-faster-internet/id1423538627?mt=8) app.\n\nAll of that is handy because do you know those [LinkNYC](https://www.link.nyc/find-a-link.html) things that are replacing phone booths across the city? They have incredibly fast and incredibly insecure (and high-target) wifi networks! But using a VPN makes me feel more comfortable.\n\n## Cryptocurrency\nI cannot see any downsides to making it easier for people to send me money.\n```\nBTC=3DE42VUyUKSikQ9eUeFKv2EkKVms7Pmd1G\nBCH=qrwzlfjhhn8jdx92a8m8e2kuxcchmmvdgguqgy23a7\nETH=0x63958715F8e9Fd6CF0652394a89bb2AdD0a11686\nLTC=MDvtqRMS6QiiXpYgxtgZKHPrYnLovjdcsZ\nXLM=ejfox*keybase.io\n```\n\nIf I was teaching a stranger or a relative about bitcoin, I would probably show them [Yenom](https://yenom.tech/) which makes it ridiculously easy to send/receive BCH. I sort of recommend Coinbase, but they’ve done [things that make me nervous](https://twitter.com/mrejfox/status/928332448068403201) in the past and are incredibly bad at responding to support requests for a company that holds people’s money. I still use the Coinbase iOS app but I do it semi-warily.\n\n## Publishing\nI publish most of my prototypes and websites through [Netlify](https://netlify.com) using the [Netlify CLI tools](https://www.netlify.com/docs/cli/), which I’ve [written about previously](https://ejfox.com/blog/how-i-prototype-apps-and-dataviz-quickly-in-2019). It makes it easy to run [one command to rebuild and redeploy my sites](https://github.com/ejfox/website/blob/master/package.json) and even create little preview sites.\n\nI’m also really excited about using [Glitch](https://glitch.me/) to create smaller apps and explanations, especially those that I might want to others to modify or fork since Glitch makes that so easy. Glitch also makes it really easy to embed little apps in my blog posts. I’m excited about the future of Glitch and want to help their methodology and ecosystem grow.\n\nAnonymous GitHub PRs can be submitted [using gitmask](https://gitmask.com) or works published on [neocities](https://neocities.org/) or Pastebin through [Tor](https://www.torproject.org/) or NordVPN’s [Onion over VPN](https://nordvpn.com/features/onion-over-vpn/).\n\n## Why is anonymity important?\n\nA lot of good work and activism can be done anonymously but it takes work to set things up properly beforehand. It is worthwhile for anyone to have a process by which they can publish materials to the web anonymously in a way that is hard to scrub from the web even if they see no need to use them currently. Prepare for rain and hope for sun.\n\nSome things need to be done anonymously... but how do you decide when?\n\n- Will the work make you a target of harassment from dark corners of the internet?\n- Will the work potentially annoy the rich and powerful who can afford to try to have you sued or silenced?\n- Will the work potentially reveal truths that governments would rather not be publicized?\n- Are you creating work that could have a large monetary value that could make you a target? (Think Bitcoin’s Satoshi)\n- Could the work potentially be used by bad actors to commit crimes?\n\n## These tools are for everyone\nI wrote this up because I was surprised at how easy it was to get set up. These are at their core very complicated systems, but over the past few decades really smart people have made them easy and approachable. Practice going through the motions of getting things set up now, you never know when that knowledge might come in handy.",
  "bodyHtml": "<h1>Computer setup</h1>\n<p>I’m a big fan of <a href=\"https://ejfox.com/blog/step-zero/\">preparation</a>. There is some part of my personality that identifies with preppers who assemble “go bags” in case of emergency. It’s the same instinct that made me want to buy a manual transmission for my first car. That way I could be sure I could drive any car I encountered.</p>\n<p>My technological set-up is similar. There are a lot of things in place that one could argue I don’t need right now, or don’t use regularly, or could be done a bit more automatically.</p>\n<p>But it makes me feel better because they are already configured and set up in case I need them, and I can get fine-tuned control when I need it.</p>\n<blockquote>\n<p>There are about a hundred little tricks like this that Hiro wouldn't know about if he hadn't been programming avatars for people like Vitaly Chernobyl for the last couple of years. To write a really good invisible avatar from scratch would take a long time, but he puts one together in several hours by recycling bits and pieces of old projects left behind in his computer. Which is how hackers usually do it.\n&lt;cite&gt;Neal Stephenson, Snow Crash, 1992&lt;/cite&gt;</p>\n</blockquote>\n<p>[[toc]]</p>\n<h4>Why?</h4>\n<p>The motivations behind doing this are not always clear to me. But in the end it comes from a core belief that computers can allow us to do amazing things. As I discover new pockets of knowledge, I also find new ways to string them together. Occasionally an idea will come to me and I can see how I would put it together because I had already experimented with some of the elements without necessarily even knowing why.</p>\n<p>I’ve written a bit about how I believe the <a href=\"https://ejfox.com/blog/the-internet-was-built-to-be-hacked\">internet was built to be hacked</a> and the tools to do so have been given to us- and they’re pretty well documented!</p>\n<p>Part of this exercise has been going back to my roots to understand some of the root technologies (like email, mailing lists, usenet, IRC, PGP, etc.) can be remembered, reused, and repurposed to build a better online world.</p>\n<p>I’ve also been watching a lot of Mr. Robot lately and it frankly just feels cool to make computers do what you want by typing the right magic words.</p>\n<h2>Passwords &amp; 2FA</h2>\n<p>1password is the core of my set up. It allows me to have secure and complicated passwords for all of my accounts / logins / keys / etc. My golden rule lately is that if I can remember my password, it isn’t strong enough.</p>\n<p>The iPhone with Face ID makes opening 1password on-the-go incredibly fast. On the desktop, I open 1password with Alfred, search for the login, and use the “CMD-shift-C” hotkey to copy the password which can be done exclusively from the keyboard relatively quickly.</p>\n<p>I use two-factor authentication on every service that offers it. Wherever possible, I <a href=\"https://authy.com/blog/understanding-2fa-the-authy-app-and-sms/\">avoid 2FA that uses my phone number</a>. I really like Authy. The app is designed intelligently and importantly they have planned for the occasion when I upgrade my phone. I recently had to go through the process of removing 2FA from all of my services when I upgraded my iPhone because I was using Google Authenticator which does not support backups. I’m not doing that again.</p>\n<h2>Using the command line</h2>\n<p>I’ve spent a long time halfway comfortable with the command line. Essentially swimming in shallow water with a <code>cd</code> here and and <code>ls</code> there. I wanted to take some concentrated time to become more familiar with the command line. The eventual goal would be to be able to sign onto any *nix command line and be able to navigate and get stuff done.</p>\n<p>For now, I’m just focusing on using the command line more in my everyday life. I am finding there are certain tasks I prefer to tackle in different ways, but part of the process is exposing myself to all the different potential tools I could use.</p>\n<h3>iTerm hotkey window</h3>\n<p>At any time I can <a href=\"https://www.typefloundry.com/1-800-iterm-bling.html\">easily conjure a terminal</a> by pressing “cmd-shift-I” which makes it easier to jump in and out of the CLI with basically no friction.</p>\n<h3>tmux</h3>\n<p>I’m also running <a href=\"https://hackernoon.com/a-gentle-introduction-to-tmux-8d784c404340\">tmux</a> so creating a new window is a quick “ctrl-a c” and I’m off and running. I’ve also been using “ctrl-a w” which is basically a tmux version of alt-tab and lets me go between my different windows with the arrow keys.</p>\n<h3>vim</h3>\n<p>I only just started using vim, and it required setting it up <em>just</em> right for [my personal setup](https://github.com/ejfox/dotfiles/blob/master/.vimrc “My vim configuration file is hosted on GitHub with the rest of my dotfiles”). I’ve been collecting helpful commands or tools with the <a href=\"https://pinboard.in/u:ejfox/t:vim\"><strong>vim</strong> tag on pinboard</a></p>\n<ul>\n<li><a href=\"https://github.com/scrooloose/nerdtree\">nerdtree</a> for a file explorer</li>\n<li><a href=\"https://github.com/junegunn/fzf#respecting-gitignore-hgignore-and-svnignore\">fzf</a> which I’ve remapped to ctrl-p (like Atom) so I can quickly search files in my directory to open</li>\n<li><a href=\"https://github.com/itchyny/lightline.vim\">lightline</a> is a statusline for vim that makes it easy to see what mode I’m in</li>\n</ul>\n<h3>cli tools</h3>\n<ul>\n<li><a href=\"https://github.com/jesseduffield/lazygit\">lazygit</a> is an amazing tool for doing most git-related tasks easily and sanely without memorizing tons of commands - I use it all the time in combination with vim</li>\n<li><a href=\"https://github.com/lra/mackup\">mackup</a> has been instrumental for me. It allows you to back up your application settings and dotfiles through Dropbox. It lets a lot of my hotkey and app settings stay the same between my personal and work machine without having to set everything up all the time. It also makes it really easy to spin up on new machines/VMs.</li>\n<li><a href=\"https://github.com/AdrianSchneider/jsonfui\">jsonfui</a> is a great CLI interface for JSON data, and a way more performant way of exploring large datasets than loading them into a Atom or a browser and waiting for the prettification. It's also nice to be able to pipe outputs of node scripts to a quick UI.</li>\n<li><a href=\"https://github.com/sharkdp/fd\">fd</a> as a fast alternative to the native <code>find</code> command</li>\n<li><a href=\"https://github.com/posva/catimg\">catimg</a> allows you to preview images in the terminal which is pretty rad and marginally useful</li>\n<li><a href=\"https://medium.com/@stessyco/gmail-from-the-command-line-with-mutt-mac-os-x-92d047bcd74f\">mutt</a> lets me send and receive email from the command line which is rad and a nice no-frills interface that makes one feel like a Real Hacker</li>\n<li><a href=\"https://github.com/newsboat/newsboat\">newsboat</a> is like mutt for RSS feeds</li>\n<li><a href=\"https://bitbucket.org/LaNMaSteR53/recon-ng\">recon-ng</a> is a tool used for OSINT research, using a variety of Python scripts and APIs to look up publicly available information for research purposes</li>\n</ul>\n<h2>Communicating</h2>\n<p>I really love <a href=\"https://keybase.io/\">Keybase</a>! They make getting started with cryptography really fun. I’ve understood the concepts and methodology of PGP before, and even generated a key and promptly never used it. But Keybase bridged the gap for me.</p>\n<p>I now have a <a href=\"https://keybase.io/ejfox\">keybase profile</a> that lists a handful of verified identities and addresses that are provably me. I am also now hosting my public PGP key at <a href=\"https://ejfox.com/pgp.txt\">https://ejfox.com/pgp.txt</a> so that people who want to send me encrypted messages can do so. It is easy to import with <code>curl https://ejfox.com/pgp.txt | gpg --import</code></p>\n<p>It’s also nice that, even as much as I trust keybase, the PGP key is <a href=\"https://jacob.hoffman-andrews.com/README/the-safe-way-to-put-a-pgp-key-in-your-twitter-bio/\">hosted on an HTTPS website that I exclusively control</a>.</p>\n<p>My key is also hosted in multiple places, so you can confirm my public key <a href=\"https://github.com/ejfox.gpg\">on GitHub</a> is the same as the one <a href=\"https://ejfox.com/pgp.txt\">I host</a> which is the same as the one <a href=\"https://keybase.io/ejfox/pgp_keys.asc\">on Keybase</a>.</p>\n<p>A semi-automated way to do this comparison is by appending all 3 keys to a txt file and comparing them ^[Or you can just run <a href=\"https://gist.github.com/ejfox/d64a7da835ef51ef67c376fdf6d0b542\">this gist</a> as a one-liner: <code>sh -c &quot;$(curl -fsSL https://gist.githubusercontent.com/ejfox/d64a7da835ef51ef67c376fdf6d0b542/raw/0c5724ab43ea5af6a25d3544e43fcfe75bce8d41/verify-pgp.sh)&quot;</code>].</p>\n<pre><code class=\"hljs\">curl https://github.com/ejfox.gpg | gpg --with-colons --import-options import-show --dry-run --import &gt;&gt; fp.txt\n\ncurl https://ejfox.com/pgp.txt | gpg --with-colons --import-options import-show --dry-run --import &gt;&gt; fp.txt\n\ncurl https://keybase.io/ejfox/pgp_keys.asc | gpg --with-colons --import-options import-show --dry-run --import &gt;&gt; fp.txt\n\ngrep 89CD fp.txt</code></pre><p>Which should return the same matching fingerprint from all 3 files. ^[If any of my publicly-posted keys (or fingerprints) do not match please <a href=\"mailto:ejfox@ejfox.com\">contact me immediately</a> because something weird is afoot.]</p>\n<pre><code>fpr:::::::::5D30A33E08E35B8915B4C7E2E2078E653FE389CD:\nfpr:::::::::5D30A33E08E35B8915B4C7E2E2078E653FE389CD:\nfpr:::::::::5D30A33E08E35B8915B4C7E2E2078E653FE389CD:\n</code></pre>\n<p>My <a href=\"https://ejfox.keybase.pub/\">website is backed up</a> on the <a href=\"https://keybase.io/docs/kbfs\">Keybase filesystem</a> as part of my <a href=\"https://github.com/ejfox/website/blob/master/package.json#L14\">site’s deploy process</a>.</p>\n<p>I’ve got the <a href=\"https://gpgtools.org/\">GPG Suite</a> for OS X which makes it so you can store your PGP key passphrase in the keychain. This makes it easier to do a handful of things, including <a href=\"https://help.github.com/en/articles/signing-commits\">signing git commits</a> with my key without having to enter my passphrase every time.</p>\n<p>I’m also using <a href=\"https://flowcrypt.com/\">FlowCrypt</a> which makes it easy to encrypt and decrypt emails in gmail through a Chrome extension. Like Keybase, it makes something that has been really complicated before really easy and accessible and low-friction.</p>\n<p>I wish people still used IRC, but it really doesn’t seem like they do (invite me to your server). I think the future looks a lot less like Slack or Discord and a lot more like an anonymous decentralized encrypted IRC. As far as I can tell, that’s this thing called <a href=\"http://matrix.org/\">matrix</a>.</p>\n<p>Matrix even supports <a href=\"https://matrix.org/blog/2015/04/22/matrix-irc-application-service/\">bridging with IRC channels</a> and I like that kind of backwards compatibility. On the downside, however, it looks like literally no one uses these yet. I’ve been playing around with <a href=\"https://about.riot.im/\">riot.im</a> as my web/ios matrix client and don’t have many complaints, but I don’t use it that much.</p>\n<h2>Surfing the web</h2>\n<p>I recently got rid of the internet connection at my apartment. It doesn’t mean I don’t use the internet, but I no longer have the ability to sit around and watch Netflix or play video games online all day. It’s been an experiment that’s been going well- what started as two weeks has stretched to over 2 months.</p>\n<p>I’ve been looking into getting rid of my cable connection while I wait for real consumer-facing 5G. In the meantime I’ve been looking into a group called <a href=\"https://www.nycmesh.net/faq#free\">NYC Mesh</a> who are building a low-cost mesh wifi network across New York City. This ties into a lot of ideas I have about democratizing access to the internet and more general mutual aid.</p>\n<p>I’ve been tethering to my iPhone a lot too, which has meant slightly adjusting my internet habits and figuring out ways to reduce my data usage and still get work done and enjoy myself. This adds to my sense of freedom- anywhere I have cell phone service I can do essentially anything.</p>\n<p>I’ve been really interested in the work being done with the <a href=\"https://brave.com/\">Brave Browser</a> especially the <a href=\"https://basicattentiontoken.org/\">Basic Attention Token</a> which among other things, allows people who browse the web to give money to content publishers through automated microtransactions (which I think is probably the future of healthy content consumption on the internet).</p>\n<h4>VPN</h4>\n<p>I really like <a href=\"https://nordvpn.com/\">NordVPN</a> last time I’d checked they had relatively good reviews from folks I trusted, they are pretty affordable, they take cryptocurrency, and their desktop and iOS apps are actually really nice. I usually have a VPN running on my desktop and phone in addition to the <a href=\"https://itunes.apple.com/us/app/1-1-1-1-faster-internet/id1423538627?mt=8\">1.1.1.1</a> app.</p>\n<p>All of that is handy because do you know those <a href=\"https://www.link.nyc/find-a-link.html\">LinkNYC</a> things that are replacing phone booths across the city? They have incredibly fast and incredibly insecure (and high-target) wifi networks! But using a VPN makes me feel more comfortable.</p>\n<h2>Cryptocurrency</h2>\n<p>I cannot see any downsides to making it easier for people to send me money.</p>\n<pre><code>BTC=3DE42VUyUKSikQ9eUeFKv2EkKVms7Pmd1G\nBCH=qrwzlfjhhn8jdx92a8m8e2kuxcchmmvdgguqgy23a7\nETH=0x63958715F8e9Fd6CF0652394a89bb2AdD0a11686\nLTC=MDvtqRMS6QiiXpYgxtgZKHPrYnLovjdcsZ\nXLM=ejfox*keybase.io\n</code></pre>\n<p>If I was teaching a stranger or a relative about bitcoin, I would probably show them <a href=\"https://yenom.tech/\">Yenom</a> which makes it ridiculously easy to send/receive BCH. I sort of recommend Coinbase, but they’ve done <a href=\"https://twitter.com/mrejfox/status/928332448068403201\">things that make me nervous</a> in the past and are incredibly bad at responding to support requests for a company that holds people’s money. I still use the Coinbase iOS app but I do it semi-warily.</p>\n<h2>Publishing</h2>\n<p>I publish most of my prototypes and websites through <a href=\"https://netlify.com\">Netlify</a> using the <a href=\"https://www.netlify.com/docs/cli/\">Netlify CLI tools</a>, which I’ve <a href=\"https://ejfox.com/blog/how-i-prototype-apps-and-dataviz-quickly-in-2019\">written about previously</a>. It makes it easy to run <a href=\"https://github.com/ejfox/website/blob/master/package.json\">one command to rebuild and redeploy my sites</a> and even create little preview sites.</p>\n<p>I’m also really excited about using <a href=\"https://glitch.me/\">Glitch</a> to create smaller apps and explanations, especially those that I might want to others to modify or fork since Glitch makes that so easy. Glitch also makes it really easy to embed little apps in my blog posts. I’m excited about the future of Glitch and want to help their methodology and ecosystem grow.</p>\n<p>Anonymous GitHub PRs can be submitted <a href=\"https://gitmask.com\">using gitmask</a> or works published on <a href=\"https://neocities.org/\">neocities</a> or Pastebin through <a href=\"https://www.torproject.org/\">Tor</a> or NordVPN’s <a href=\"https://nordvpn.com/features/onion-over-vpn/\">Onion over VPN</a>.</p>\n<h2>Why is anonymity important?</h2>\n<p>A lot of good work and activism can be done anonymously but it takes work to set things up properly beforehand. It is worthwhile for anyone to have a process by which they can publish materials to the web anonymously in a way that is hard to scrub from the web even if they see no need to use them currently. Prepare for rain and hope for sun.</p>\n<p>Some things need to be done anonymously... but how do you decide when?</p>\n<ul>\n<li>Will the work make you a target of harassment from dark corners of the internet?</li>\n<li>Will the work potentially annoy the rich and powerful who can afford to try to have you sued or silenced?</li>\n<li>Will the work potentially reveal truths that governments would rather not be publicized?</li>\n<li>Are you creating work that could have a large monetary value that could make you a target? (Think Bitcoin’s Satoshi)</li>\n<li>Could the work potentially be used by bad actors to commit crimes?</li>\n</ul>\n<h2>These tools are for everyone</h2>\n<p>I wrote this up because I was surprised at how easy it was to get set up. These are at their core very complicated systems, but over the past few decades really smart people have made them easy and approachable. Practice going through the motions of getting things set up now, you never know when that knowledge might come in handy.</p>\n",
  "title": "Computer setup",
  "dir": "content/blog/posts",
  "base": "computer-setup-2019.json",
  "ext": ".json",
  "sourceBase": "computer-setup-2019.md",
  "sourceExt": ".md"
}