{
  "title": "Daily Creations",
  "body": "**Starting January 2019**\n\nI wanted to formalize my creative practices by getting in the habit of publishing them and writing about them publicly. I have the bad habit of making things and texting a photo to one friend and then shoving them away in a folder somewhere.\n\nI've tried not to set too many rules for myself, other than to try and create something every day. I want to try a wide array of different small-to-medium projects using different processes and materials. The goal is to start getting in the habit of documenting my work as well as the decisions that went into the process of creating them.\n\nI will be updating this post with each creation, newest at the top. Wish me luck!\n\n## January\n+ **Jan 11:**\n+ **Jan 9-10:** I was really focused on creating a new tool for work and made a ton of progress on it, but can't share much here yet - *I don't think this really counts but I'm just figuring this whole thing out*\n+ **Jan 8:** Made my first [Pico-8 generative art program](https://twitter.com/mrejfox/status/1082446247997382656) that makes expanding circles with random colors that the user can move around the screen. Not very impressive, but very easy and fun to put together. Really inspiring to feel the power of the limitations of this little tool. <img src=\"https://res.cloudinary.com/ejf/image/upload/v1547323810/ej-first_0.gif\" />\n+ **Jan 7:** Made an example page of my [\"Internet Weather Report\"](https://dreamy-torvalds-1238a8.netlify.com/) website idea, AKA \"hipster drudge\" <img src=\"https://res.cloudinary.com/ejf/image/upload/v1547323648/Screenshot_2019-01-07_02.19.23.png\" />\n+ **Jan 6:** Did a directional arrow drawing on a blank puzzle I got from the art store\n+ **Jan 5:** Made first-ever linocut of an Air Jordan 1 mid I traced from a book. Pretty pleased with the results <img src=\"https://res.cloudinary.com/ejf/image/upload/v1547323425/UNADJUSTEDNONRAW_thumb_2d82.jpg\" /> <img src=\"https://res.cloudinary.com/ejf/image/upload/v1547323384/Screenshot_2019-01-12_15.02.28.png\" /> \n+ **Jan 4:** Added watercolors to an older drawing, didn't really like the results though. Experimented with mixing large amounts of water and pigment in the bottom of mason jars for large washes with strong color to mixed results. Ended up being just being too much at once. Need to remember to leave negative space and let parts of the paper come through all the way to the end.  \n+ Jan 3: Same deal, I'm not good at doing things every day\n+ Jan 2: I fucked up and [played Hitman 3](https://twitter.com/mrejfox/status/1080255162671869953) literally all day and didn't make anything, literally day 2 of this thing, idk\n+ **Jan 1:** Traced type and linocuts from [*Type. A Visual History of Typefaces & Graphic Styles: 1628 to 1938*](https://www.taschen.com/pages/en/catalogue/graphic_design/all/44618/facts.type_a_visual_history_of_typefaces_graphic_styles.htm) for practice and to potentially use in later works <img src=\"https://res.cloudinary.com/ejf/image/upload/v1547323603/Screenshot_2019-01-12_15.06.38.png\" />\n\n## Goals\n\n+ Create some sort of visual creation every day (photo, image, GIF, or video)\n+ Put more effort into documenting the creation and making notes of things learned\n+ Spend more time returning to previous experiments, improving on them, and mixing different ideas together\n+ Being more thoughtful in practicing new techniques and perfecting old ones",
  "type": "words",
  "hidden": false,
  "date": "2019-01-01T00:01:00-05:00",
  "hidetimestamp": false,
  "bgcolorclass": "",
  "textcolorclass": ""
}