{
  "type": "words",
  "hidden": false,
  "inprogress": false,
  "date": "2019-03-19T21:25:22-04:00",
  "hidetimestamp": false,
  "bodyContent": "# How I prototype apps and dataviz quickly\n\n[[toc]]\n\nI’ve been really enjoying using Vue as a framework for my javascript applications. It allows me to quickly and easily lay out my data structure, some DOM-elements that are controlled by data, and handle any interactions / application state stuff I might need. \n\nIn years past, my development workflow usually started with me cloning my [@ejfox/starter](https://github.com/ejfox/starter) project, which has gulp, webpack, and a handful of other useful frameworks for making things quickly already set up.\n\nNow, since it’s upgrade to 3.0, I pretty much exclusively use \n`> vue create project-name` which gives you a little CLI wizard to create a new Vue project. Importantly, you can manually select the features you want and create your own project defaults. \n\nMine, for example, automatically pulls in the Router, Vuex, Linter, and Stylus. \n\nI [recorded a video of myself spinning up a prototype](https://www.youtube.com/watch?v=Q6e4pQccMH4) of a D3 force layout using the techniques I describe below, it’s around 90 minutes but you can tell YouTube to play it double-speed and click around - if you’re curious.  \n\n## Pulling in data\nIn my old starter project, I would pull in data with [d3.queue](https://github.com/ejfox/starter/blob/master/src/coffee/app.coffee#L19) which was super easy and very little code.\n\nWith Vue as my default framework, I’ve moved over to using the [pattern of using axios to update objects in the component’s data](https://vuejs.org/v2/cookbook/using-axios-to-consume-apis.html) which is also super easy and very little code. Check out [this super-simple example of axios+vue](https://github.com/ejfox/website/blob/master/pages/vibes.vue#L42) which powers [ejfox.com/vibes](https://ejfox.com/vibes). \n\nWhen I’m pulling data from an API, it’s as simple as setting up the keys, building the API call, looking at the returned data in the Vue Chrome Devtools Inspector, and then building out the DOM elements with Vue’s [v-if and v-for](https://vuejs.org/v2/guide/list.html) directives.\n\n## Combining Vue and D3 for dataviz\nPart of the reason that I really like using Vue is that it meshes with my understanding of D3, which I use to create a majority of my data visualization work both personally and professionally.\n\nVue makes it so that we no longer need our old, trusty friend `d3.select().enter().append().exit()` to bind data to various DOM elements, since Vue is doing it for us. \n\nBefore Vue, I would have an SVG already on the page and do something like\n```\nconst svg = d3.select('svg')\nconst circles = d3.selectAll('circle')\n\t.data(myData)\n\t.enter()\n\t.append('circle')\n\t.attr(d => {\n\t\treturn {\n\t\t\tr: d.radius,\n\t\t\tcx: d.x,\n\t\t\tcy: d.y\n\t\t}\n\t})\n```\n\nBut now with Vue, I just use the HTML declarations in the template like - because of the built-in reactivity, when the data changes the DOM elements are updated. No need for the old D3 select, enter, append pattern.\n```\n<svg>\n\t<circle\n\t\tv-for=\"circle in myData\"\n\t\t:r=\"circle.radius\"\n\t\t:cx=\"circle.x\"\n\t\t:cy=\"circle.y\" />\n</svg>\n```\n\nI still use a ton of D3 functions though, [topojson-client](https://github.com/topojson/topojson-client), all the D3 number and color scales, force layouts, etc.\n\n#### Animating entering/exiting\nIf I want to fade elements in and out like you would do with `d3.select(selection).enter().transition(t).style(‘opacity’, 1)` I’ve been using [animate.css](https://daneden.github.io/animate.css/) in combination with [Vue’s custom transition classes](https://vuejs.org/v2/guide/transitions.html#Custom-Transition-Classes). So I’ll do something like \n\n```\n\t<circle\n\t\tv-for=\"circle in myData\"\n\t\tenter-active-class=\"animated fadeIn\"\n\t\tleave-active-class=\"animated fadeOut\" />\n```\n\nIt’s also easy enough to use this same pattern with custom-made CSS transitions or animations, but I don’t find myself doing that too often. \n\n## Database and user authentication\nOver the past 3 months or so, I’ve fallen head over heels for the combination of Vue and Firestore via the [vue-firestore](https://www.npmjs.com/package/vue-firestore) Vue binding. You set up your Firebase app, plug in all your auth keys, and then bind data objects to firestore collections. This binding is instantaneous and reactive, so if your Vue template references an object that is bound to a collection, the page automatically updates if an item is added, removed, or changed in firestore. You don’t have to do anything different. It feels like magic. \n\nSo far for me Vue + Firestore has been fast, easy, and scalable. It reminds me of working with Meteor.js way back when. \n\n## Deploying\nI’ve been really enjoying using Netlify, and the Netlify CLI makes things even easier and faster. Once I’m ready to show someone what I’ve been working on, I just do `npm run build; netlify deploy —dir=dist` and the CLI walks me through creating a URL. \n\nIf I end up working on a project for a few days, I’ll go ahead and set up [Netlify’s continuous deployment](https://www.netlify.com/docs/continuous-deployment/) with a GitHub repo so that every time I push to master netlify automatically re-builds production from the latest commit. \n\nIt doesn’t happen that often, but if I want to go even further, it is super easy to just buy a domain name from [Namecheap](https://namecheap.com) and point it at the Netlify DNS servers. Netlify delivers websites incredibly fast, especially [combined with Nuxt](https://nuxtjs.org/faq/netlify-deployment/). \n\nIf I need to host really big files that I don’t want to put into a git repo, I’ll put them on S3 and reference the uploaded URLs in the project. I’ve also been experimenting with using [Cloudinary](https://cloudinary.com/) for hosting my images.\n\nFrom start to finish, I can do everything described in this guide in about 30 minutes.\n\nThe lack of friction with this workflow causes me to try and start new things more often. This is really important to me right now as I experiment with different technologies and approaches. I have definitely had ideas and hesitated to start giving them a try because I knew I would need to spin up a new project, set up my IDE, etc. Code that exists is better than a good idea. I’d rather have a dozen half-built prototypes than a hundred good ideas.",
  "bodyHtml": "<h1>How I prototype apps and dataviz quickly</h1>\n<p>[[toc]]</p>\n<p>I’ve been really enjoying using Vue as a framework for my javascript applications. It allows me to quickly and easily lay out my data structure, some DOM-elements that are controlled by data, and handle any interactions / application state stuff I might need.</p>\n<p>In years past, my development workflow usually started with me cloning my <a href=\"https://github.com/ejfox/starter\">@ejfox/starter</a> project, which has gulp, webpack, and a handful of other useful frameworks for making things quickly already set up.</p>\n<p>Now, since it’s upgrade to 3.0, I pretty much exclusively use\n<code>&gt; vue create project-name</code> which gives you a little CLI wizard to create a new Vue project. Importantly, you can manually select the features you want and create your own project defaults.</p>\n<p>Mine, for example, automatically pulls in the Router, Vuex, Linter, and Stylus.</p>\n<p>I <a href=\"https://www.youtube.com/watch?v=Q6e4pQccMH4\">recorded a video of myself spinning up a prototype</a> of a D3 force layout using the techniques I describe below, it’s around 90 minutes but you can tell YouTube to play it double-speed and click around - if you’re curious.</p>\n<h2>Pulling in data</h2>\n<p>In my old starter project, I would pull in data with <a href=\"https://github.com/ejfox/starter/blob/master/src/coffee/app.coffee#L19\">d3.queue</a> which was super easy and very little code.</p>\n<p>With Vue as my default framework, I’ve moved over to using the <a href=\"https://vuejs.org/v2/cookbook/using-axios-to-consume-apis.html\">pattern of using axios to update objects in the component’s data</a> which is also super easy and very little code. Check out <a href=\"https://github.com/ejfox/website/blob/master/pages/vibes.vue#L42\">this super-simple example of axios+vue</a> which powers <a href=\"https://ejfox.com/vibes\">ejfox.com/vibes</a>.</p>\n<p>When I’m pulling data from an API, it’s as simple as setting up the keys, building the API call, looking at the returned data in the Vue Chrome Devtools Inspector, and then building out the DOM elements with Vue’s <a href=\"https://vuejs.org/v2/guide/list.html\">v-if and v-for</a> directives.</p>\n<h2>Combining Vue and D3 for dataviz</h2>\n<p>Part of the reason that I really like using Vue is that it meshes with my understanding of D3, which I use to create a majority of my data visualization work both personally and professionally.</p>\n<p>Vue makes it so that we no longer need our old, trusty friend <code>d3.select().enter().append().exit()</code> to bind data to various DOM elements, since Vue is doing it for us.</p>\n<p>Before Vue, I would have an SVG already on the page and do something like</p>\n<pre><code>const svg = d3.select('svg')\nconst circles = d3.selectAll('circle')\n\t.data(myData)\n\t.enter()\n\t.append('circle')\n\t.attr(d =&gt; {\n\t\treturn {\n\t\t\tr: d.radius,\n\t\t\tcx: d.x,\n\t\t\tcy: d.y\n\t\t}\n\t})\n</code></pre>\n<p>But now with Vue, I just use the HTML declarations in the template like - because of the built-in reactivity, when the data changes the DOM elements are updated. No need for the old D3 select, enter, append pattern.</p>\n<pre><code>&lt;svg&gt;\n\t&lt;circle\n\t\tv-for=&quot;circle in myData&quot;\n\t\t:r=&quot;circle.radius&quot;\n\t\t:cx=&quot;circle.x&quot;\n\t\t:cy=&quot;circle.y&quot; /&gt;\n&lt;/svg&gt;\n</code></pre>\n<p>I still use a ton of D3 functions though, <a href=\"https://github.com/topojson/topojson-client\">topojson-client</a>, all the D3 number and color scales, force layouts, etc.</p>\n<h4>Animating entering/exiting</h4>\n<p>If I want to fade elements in and out like you would do with <code>d3.select(selection).enter().transition(t).style(‘opacity’, 1)</code> I’ve been using <a href=\"https://daneden.github.io/animate.css/\">animate.css</a> in combination with <a href=\"https://vuejs.org/v2/guide/transitions.html#Custom-Transition-Classes\">Vue’s custom transition classes</a>. So I’ll do something like</p>\n<pre><code>\t&lt;circle\n\t\tv-for=&quot;circle in myData&quot;\n\t\tenter-active-class=&quot;animated fadeIn&quot;\n\t\tleave-active-class=&quot;animated fadeOut&quot; /&gt;\n</code></pre>\n<p>It’s also easy enough to use this same pattern with custom-made CSS transitions or animations, but I don’t find myself doing that too often.</p>\n<h2>Database and user authentication</h2>\n<p>Over the past 3 months or so, I’ve fallen head over heels for the combination of Vue and Firestore via the <a href=\"https://www.npmjs.com/package/vue-firestore\">vue-firestore</a> Vue binding. You set up your Firebase app, plug in all your auth keys, and then bind data objects to firestore collections. This binding is instantaneous and reactive, so if your Vue template references an object that is bound to a collection, the page automatically updates if an item is added, removed, or changed in firestore. You don’t have to do anything different. It feels like magic.</p>\n<p>So far for me Vue + Firestore has been fast, easy, and scalable. It reminds me of working with Meteor.js way back when.</p>\n<h2>Deploying</h2>\n<p>I’ve been really enjoying using Netlify, and the Netlify CLI makes things even easier and faster. Once I’m ready to show someone what I’ve been working on, I just do <code>npm run build; netlify deploy —dir=dist</code> and the CLI walks me through creating a URL.</p>\n<p>If I end up working on a project for a few days, I’ll go ahead and set up <a href=\"https://www.netlify.com/docs/continuous-deployment/\">Netlify’s continuous deployment</a> with a GitHub repo so that every time I push to master netlify automatically re-builds production from the latest commit.</p>\n<p>It doesn’t happen that often, but if I want to go even further, it is super easy to just buy a domain name from <a href=\"https://namecheap.com\">Namecheap</a> and point it at the Netlify DNS servers. Netlify delivers websites incredibly fast, especially <a href=\"https://nuxtjs.org/faq/netlify-deployment/\">combined with Nuxt</a>.</p>\n<p>If I need to host really big files that I don’t want to put into a git repo, I’ll put them on S3 and reference the uploaded URLs in the project. I’ve also been experimenting with using <a href=\"https://cloudinary.com/\">Cloudinary</a> for hosting my images.</p>\n<p>From start to finish, I can do everything described in this guide in about 30 minutes.</p>\n<p>The lack of friction with this workflow causes me to try and start new things more often. This is really important to me right now as I experiment with different technologies and approaches. I have definitely had ideas and hesitated to start giving them a try because I knew I would need to spin up a new project, set up my IDE, etc. Code that exists is better than a good idea. I’d rather have a dozen half-built prototypes than a hundred good ideas.</p>\n",
  "title": "How I prototype apps and dataviz quickly",
  "dir": "content/blog/posts",
  "base": "how-i-prototype-apps-and-dataviz-quickly-in-2019.json",
  "ext": ".json",
  "sourceBase": "how-i-prototype-apps-and-dataviz-quickly-in-2019.md",
  "sourceExt": ".md"
}