{
  "dek": "The newest weapon in the arsenal of internet nazis is mass-brigading Twitter reports, and it’s working",
  "type": "words",
  "hidden": false,
  "inprogress": false,
  "date": "2012-02-14T21:19:39-04:00",
  "hidetimestamp": false,
  "bodyContent": "# Online Nazis Have Figured Out How To Game Twitter Moderators\n\nOne of the newest weaknesses online trolls are exploiting is one of the mechanisms built to defend against them, Twitter’s system for reporting tweets that violate their Terms of Service.\n\nTwitter doesn’t detail publicly the mechanisms used to decide which tweets and accounts get removed, how many reports trigger a human moderator, or whether a certain amount of reports automatically triggers a ban. \n\nRecently the Twitter account for the magazine Jewish Worker [@JewishWorker](https://twitter.com/jewishworker) was suspended from Twitter for [“posting private information”](https://twitter.com/selfagency_llc/status/1195481914007805952) after a series of tweets about a journalism project that revealed the identities of alleged white supremacists. \n\nAnother victim of targeted mass reporting is the journalist Barrett Brown who was [repeatedly banned from Twitter](https://www.dailydot.com/layer8/barrett-brown-twitter-suspension/) after being targeted by a group of far-right trolls known to organize and mass-report their online enemies, and who publicly celebrated their success in gaming Twitter’s moderation systems and getting Brown banned. \n\nTelegram groups, like the [“Mass Report and Retweet thread”](https://t.me/s/RTandReport?before=248) previously reported in March by [the Daily Beast](https://www.thedailybeast.com/proud-boys-cite-twitter-ceo-jack-dorsey-to-attack-antifa) continues to be filled with one-way blasts of Twitter posts, accompanied by which option should be selected when reporting the tweet: most often “report as abusive”, or “personal info”.\n\nA tweet with photos of 4 alleged Proud Boys was posted to the channel along with the text “targeted harrasment”, indicating to members of the channel what they should report the tweet for in order to trigger a takedown.\n\nSome of the links to tweets they target for mass-reporting have been deleted, meaning they were removed by Twitter or the users themselves. \n\nThe Proud Boys Telegram channel [also celebrates when they succeed](https://twitter.com/lcrwnews/status/1129246175628890113?lang=en) in gaming the Twitter moderation system and getting an enemy suspended. – after an independent journalist [got the attention of the Proud Boys](https://onezero.medium.com/nazis-got-me-kicked-off-of-twitter-aaf6ad814104), she was targeted. A screenshot of her suspension was later posted to the Telegram channel accompanied by the text “Great job! Let’s keep this shit up!” \n\nEven in cases where mass-reporting was unable to trigger automated or semi-automated systems within Twitter to suspend the targeted accounts, the barrage of attention and abuse from the organized trolls had the desired effect. \n\nOne post from the group celebrates a target deleting their own post: “Good work all around boys, we are calling it off now. The leftist in question has removed his post attacking our brothers business due to being corrected by all of you.”\n\nActivists have responded with criticism of Twitter, with one user tweeting “The message from Twitter is clear: If a group of violent white supremacists mobilizes to silence journalists for exposing their allies' identities, they will comply with the wishes of the violent white supremacists.”",
  "bodyHtml": "<h1>Online Nazis Have Figured Out How To Game Twitter Moderators</h1>\n<p>One of the newest weaknesses online trolls are exploiting is one of the mechanisms built to defend against them, Twitter’s system for reporting tweets that violate their Terms of Service.</p>\n<p>Twitter doesn’t detail publicly the mechanisms used to decide which tweets and accounts get removed, how many reports trigger a human moderator, or whether a certain amount of reports automatically triggers a ban.</p>\n<p>Recently the Twitter account for the magazine Jewish Worker <a href=\"https://twitter.com/jewishworker\">@JewishWorker</a> was suspended from Twitter for <a href=\"https://twitter.com/selfagency_llc/status/1195481914007805952\">“posting private information”</a> after a series of tweets about a journalism project that revealed the identities of alleged white supremacists.</p>\n<p>Another victim of targeted mass reporting is the journalist Barrett Brown who was <a href=\"https://www.dailydot.com/layer8/barrett-brown-twitter-suspension/\">repeatedly banned from Twitter</a> after being targeted by a group of far-right trolls known to organize and mass-report their online enemies, and who publicly celebrated their success in gaming Twitter’s moderation systems and getting Brown banned.</p>\n<p>Telegram groups, like the <a href=\"https://t.me/s/RTandReport?before=248\">“Mass Report and Retweet thread”</a> previously reported in March by <a href=\"https://www.thedailybeast.com/proud-boys-cite-twitter-ceo-jack-dorsey-to-attack-antifa\">the Daily Beast</a> continues to be filled with one-way blasts of Twitter posts, accompanied by which option should be selected when reporting the tweet: most often “report as abusive”, or “personal info”.</p>\n<p>A tweet with photos of 4 alleged Proud Boys was posted to the channel along with the text “targeted harrasment”, indicating to members of the channel what they should report the tweet for in order to trigger a takedown.</p>\n<p>Some of the links to tweets they target for mass-reporting have been deleted, meaning they were removed by Twitter or the users themselves.</p>\n<p>The Proud Boys Telegram channel <a href=\"https://twitter.com/lcrwnews/status/1129246175628890113?lang=en\">also celebrates when they succeed</a> in gaming the Twitter moderation system and getting an enemy suspended. – after an independent journalist <a href=\"https://onezero.medium.com/nazis-got-me-kicked-off-of-twitter-aaf6ad814104\">got the attention of the Proud Boys</a>, she was targeted. A screenshot of her suspension was later posted to the Telegram channel accompanied by the text “Great job! Let’s keep this shit up!”</p>\n<p>Even in cases where mass-reporting was unable to trigger automated or semi-automated systems within Twitter to suspend the targeted accounts, the barrage of attention and abuse from the organized trolls had the desired effect.</p>\n<p>One post from the group celebrates a target deleting their own post: “Good work all around boys, we are calling it off now. The leftist in question has removed his post attacking our brothers business due to being corrected by all of you.”</p>\n<p>Activists have responded with criticism of Twitter, with one user tweeting “The message from Twitter is clear: If a group of violent white supremacists mobilizes to silence journalists for exposing their allies' identities, they will comply with the wishes of the violent white supremacists.”</p>\n",
  "title": "Online Nazis Have Figured Out How To Game Twitter Moderators",
  "dir": "content/blog/posts",
  "base": "online-brigades-gaming-twitter.json",
  "ext": ".json",
  "sourceBase": "online-brigades-gaming-twitter.md",
  "sourceExt": ".md"
}