{
  "dek": "In which the author makes the case for the merits of a certain approach to preparation",
  "type": "words",
  "hidden": false,
  "inprogress": false,
  "date": "2019-06-12T17:40:00-04:00",
  "hidetimestamp": false,
  "bodyContent": "# Step Zero\n\nThis can also be called <em>[mise en place](https://en.wikipedia.org/wiki/Mise_en_place)</em>. It’s a concept from cooking that describes advanced preparation for a meal. You cut your onions and carrots beforehand and keep them in an accessible place. You gather all the spices you will need. You make your sauces.\n\nYou’re still not making the meal- you’re doing everything but. You are preparing for the optimal moment. When your friends (or customers) arrive you assemble the dish. Everything is ready. \n\nWith the right preparation it is much easier to enter a [flow state](https://en.wikipedia.org/wiki/Flow_(psychology)) where everything just comes together. It can be beautiful to experience, even as a spectator. I spend a lot of time searching out different creative ways of [reaching](https://www.are.na/block/4446495) that state. \n\nYou aren’t worried about where the salt is (it’s placed perfectly within arm’s reach). That would pull you out of your flow.\n\nWhen talking to friends about ideas or projects, I often find myself saying some version of “well the step zero for that is…” by which I mean, the task(s) that precede the actual task.[^1] All the work that comes before even beginning. \n\nWith the right [preparation](https://www.darkreading.com/the-state-of-hacktivism-in-2020-/d/d-id/1338382) not only can you accomplish the task better, but you can enjoy yourself more as you do it. \n\n[^1]: As [Carl Sagan said](https://www.youtube.com/watch?v=7s664NsLeFM) “If you wish to make an apple pie from scratch, you must first invent the universe.”",
  "bodyHtml": "<h1>Step Zero</h1>\n<p>This can also be called &lt;em&gt;<a href=\"https://en.wikipedia.org/wiki/Mise_en_place\">mise en place</a>&lt;/em&gt;. It’s a concept from cooking that describes advanced preparation for a meal. You cut your onions and carrots beforehand and keep them in an accessible place. You gather all the spices you will need. You make your sauces.</p>\n<p>You’re still not making the meal- you’re doing everything but. You are preparing for the optimal moment. When your friends (or customers) arrive you assemble the dish. Everything is ready.</p>\n<p>With the right preparation it is much easier to enter a <a href=\"https://en.wikipedia.org/wiki/Flow_(psychology)\">flow state</a> where everything just comes together. It can be beautiful to experience, even as a spectator. I spend a lot of time searching out different creative ways of <a href=\"https://www.are.na/block/4446495\">reaching</a> that state.</p>\n<p>You aren’t worried about where the salt is (it’s placed perfectly within arm’s reach). That would pull you out of your flow.</p>\n<p>When talking to friends about ideas or projects, I often find myself saying some version of “well the step zero for that is…” by which I mean, the task(s) that precede the actual task.[^1] All the work that comes before even beginning.</p>\n<p>With the right <a href=\"https://www.darkreading.com/the-state-of-hacktivism-in-2020-/d/d-id/1338382\">preparation</a> not only can you accomplish the task better, but you can enjoy yourself more as you do it.</p>\n<p>[^1]: As <a href=\"https://www.youtube.com/watch?v=7s664NsLeFM\">Carl Sagan said</a> “If you wish to make an apple pie from scratch, you must first invent the universe.”</p>\n",
  "title": "Step Zero",
  "dir": "content/blog/posts",
  "base": "step-zero.json",
  "ext": ".json",
  "sourceBase": "step-zero.md",
  "sourceExt": ".md"
}