{
  "dek": "In which we explore the knotted beauty of American democracy",
  "type": "words",
  "hidden": false,
  "inprogress": true,
  "date": "2020-04-09T03:19:38.761Z",
  "hidetimestamp": false,
  "bodyContent": "# Things I've learned about elections\n\n## Edge cases\nElections are all edge cases. Votes are cast and tallied by a wide variety of Americans who all have the same goal but often different ideas about how to go about it. Votes are cast in cities and rural areas, in places with millions of constituents or dozens. Many elections are run locally by someone you should mentally picture as your well-meaning aunt. The sheer scale of such an operation is astounding. We live in a country that spans a continent and [9 time zones](https://en.wikipedia.org/wiki/File:US-Timezones-post-2007.png). \n\nThis great country contains lots of different people with lots of different ways of going about things. \n\n[[toc]]\n\nThe basic rules around voting are laid out in the constitution^[[Article 1 of the Constitution](https://constitutioncenter.org/interactive-constitution/articles/article-i#elections-clause) “The House of Representatives shall be composed of Members chosen every second Year by the People of the several States…” - [Section 4](https://www.usconstitution.net/xconst_A1Sec4.html): “The Times, Places and Manner of holding Elections for Senators and Representatives, shall be prescribed in each State by the Legislature thereof; but the Congress may at any time by Law make or alter such Regulations, except as to the Places of chusing Senators.”] but a remarkable amount of the nitty-gritty details are [left up to each state](https://www.brennancenter.org/analysis/voting-laws-roundup-2019) to figure out. \n\nOn election day in America, polls open at a particular time and close at a particular time. Those times, like almost everything else, [depend on where you’re talking about](https://ballotpedia.org/State_Poll_Opening_and_Closing_Times_(2019)) and can vary even within a single state and could change any year. \n\nWe have grown accustomed to live results of elections. This is definitely not something our grandfathers had and is mind-bogglingly complex once you start to think about it. \n\nWith American elections “live” does not mean getting the results of votes immediately after they are cast. The closest we can get for now is seeing vote results as they are counted after polls close. ^[This makes sense, when you think about it. There is reason to believe if you could turn on your TV and see how your candidate was doing, if you could see the vote counts live and your candidate was safely ahead, you might decide it’s not even worth going out and casting a vote.] \n\n## Races\nAny particular office (be it a Senate or a President or local Sheriff) has a variety of candidates from a variety of parties. Generally we think of races as between two front runners, but people often vote for third parties or [write in candidate’s names](https://en.wikipedia.org/wiki/Write-in_candidate) and those votes need to be accounted for. \n\nHere’s what we can agree on: A **race** is run by *n* number of **candidates** for a single **office**. \n\nYou might say \"at least we can assume the candidates are human\" - but [you would be wrong](https://en.wikipedia.org/wiki/Non-human_electoral_candidates). Never assume in elections. \n\nEvery [eligible(!)](https://en.wikipedia.org/wiki/Voting_rights_in_the_United_States) person who lives in the area that candidate [represents](https://ballotpedia.org/Who_represents_me) (districts for the house, states for senators, the entire country for presidents) gets to vote between the candidates running for each office that represents them. ^[The election of Senators was not always given to the population in general. The framer’s constitution [left that to the states](https://www.senate.gov/artandhistory/history/common/generic/Feature_Homepage_ElectedStateLegislatures.htm). “The framers believed that in electing senators, state legislatures would cement their ties with the national government. They also expected that senators elected by state legislatures would be freed from pressures of public opinion and therefore better able to concentrate on legislative business and serve the needs of each state. In essence, senators would serve as “states’ ambassadors” to the federal government.” - it turned out to not work well because states never got around to electing them.]\n\n## Voting\nConstituents show up to their polling place. Or, well, [sort of](http://www.ncsl.org/research/elections-and-campaigns/absentee-and-early-voting.aspx). [39 states](http://www.ncsl.org/research/elections-and-campaigns/absentee-and-early-voting.aspx#overview) have mechanisms for early voting, 28 allow no-excuse absentee votes, 19 allow voting with an “accepted excuse”. [36 million people voted early in the midterm election.](https://www.politico.com/story/2018/11/05/early-voting-turnout-2018-elections-midterms-963149) - that’s about 30% of the [117 million](http://www.electproject.org/2018g) total votes cast. \n\nWhen reporting votes, absentee votes are typically only available at the county-level and not be precinct. \n\n### Voter Registration\nIn order to vote, an eligible potential voter must register. Voter registration is handled by government officials on the county and state level.\n\nOnce registered on voter records, voters can be removed for any of the following reason:\nVoters can be removed from records for a few reasons:\n- Disenfranchising criminal conviction\n- Mental incapacity\n- Death\n- Change in residence\n- Never eligible: under 18 or noncitizen\n- Voter self-requests removal\n\n### Voting systems\n+ [First past the post](https://en.wikipedia.org/wiki/First_past_the_post) is what most people think of. Voters mark a ballot with the candidate they want to win, and the candidate who receives the most votes wins. \n+ [Runoff voting](https://en.wikipedia.org/wiki/Two-round_system) works similarly, but there is a minimum amount of votes required. If no candidate exceeds that minimum, some candidates are eliminated and a second round of the election is held (usually with the top 2 ranked candidates).\n+ A [Louisiana primary](https://en.wikipedia.org/wiki/Louisiana_primary) is similar to an [open primary](https://ballotpedia.org/Open_primary) where all candidates running for an office appear together on the same ballot, including multiples per party (instead of a party picking a single candidate to run in a race). The race goes to runoff if no candidate wins by simple majority. \n+ Maine is the first U.S. state to enact [instant-runoff or “ranked choice” voting](https://en.wikipedia.org/wiki/Instant-runoff_voting)^[A variety of [major U.S. cities](https://en.wikipedia.org/wiki/Instant-runoff_voting_in_the_United_States) use ranked choice voting for local elections.] Instead of voting for one candidate over another, voters rank the candidates in order of preference. \n\n![Maine ranked-choice voting ballot](//ej-fox.s3.amazonaws.com/blog/maine-ranked-choice-ballot.png)\n\nThe Center for Civic Design has a [great guide](https://civicdesign.org/fieldguides/designing-usable-ballots/) for designing ballots so they are usable, which [they are often not](https://www.propublica.org/article/disenfranchised-by-bad-design). \n\n## Reporting units\nThe term “reporting unit” can refer to a boundary division of any size used to aggregate votes in an election. This can be a [town](https://en.wikipedia.org/wiki/New_England_town), [parish](https://en.wikipedia.org/wiki/List_of_parishes_in_Louisiana), [precinct](https://www.nytimes.com/interactive/2018/upshot/election-2016-voting-precinct-maps.html), county, [county sub-division](https://www.policymap.com/2015/09/county-subdivisions-the-secret-geography/) or state. \n\nPresidential, senate, and gubernatorial races are organized by county and state.\n\nHouse races are organized by house districts. The borders of these house districts are [primarily decided by state legislatures](https://ballotpedia.org/State-by-state_redistricting_procedures) but some <small>(AZ, CA, ID, WA)</small> are made by independent commissions. [538 did an excellent piece](https://projects.fivethirtyeight.com/redistricting-maps/) on congressional redistricting and gerrymandering.  \n\n## Election data\nOnce a vote is cast, ballots are counted and the counts are delivered to a central location and the numbers are reported in regular intervals (usually). That is all handled by state and local governments, often by county and state boards of elections. \n\nThe media (and by extension, the public) are given access to the vote counts at this point. Often times you can find a website run by the Secretary of State which will have the latest results for different statewide elections. Data services will pay reporters or [stringers](https://news.ycombinator.com/item?id=12912528) to go to the places where votes are counted to and send the results back to competing data services which then resell that data to news organizations (live election results are not cheap). \n\nElection day vote and [exit poll](https://ballotpedia.org/Exit_polling) [result data](https://www.pewresearch.org/fact-tank/2016/11/02/just-how-does-the-general-election-exit-poll-work-anyway/) is provided to ABC, CBS, CNN, and NBC News in a consortium called the **National Election Pool**. The data is fed by [Edison Research](https://www.edisonresearch.com/election-polling/). \n\nAlternatives for live data include [Decision Desk HQ](https://decisiondeskhq.com/) or the [AP Elections API](https://developer.ap.org/ap-elections-api/).\n\nHistorical data can be found from the above sources as well as from [MIT](https://electionlab.mit.edu/data) or [OpenElections](http://www.openelections.net/). [MapBox](https://www.mapbox.com/elections) also has pre-bound boundaries with historical data.\n\nCounty-level presidential results 2008-2016 have been [collected in this GitHub repo](https://github.com/tonmcg/US_County_Level_Election_Results_08-16)\n\n### Geographic Identifiers: FIPS Codes\n\nStates can be identified via their name (`New York`), [abbreviation](https://gist.github.com/mshafrir/2646763) (`NY`), or a state FIPS code  ([36](https://www.mcc.co.mercer.pa.us/dps/state_fips_code_listing.htm)). \n\nHouse districts are identified by their district code. New York’s first district is `NY-01`. Large states with smaller populations like [Montana](https://en.wikipedia.org/wiki/Montana%27s_at-large_congressional_district) have only one congressional district (“at large”), denoted like `MT-AL`. \n\nI’ve seen various systems handle this different ways. Some designate these districts with `MT-00` so at least you can rely on two numeric digits when writing your code.  \n\nCounties are identified by [county FIPS codes](https://en.wikipedia.org/wiki/List_of_United_States_FIPS_codes_by_county). The first two numbers of a county FIPS code are the state code, which is handy. \n\n### Mapping live election results\nAt NBC the Big Board is commanded by Steve Kornacki, who is the best in the business if you ask me. He stands by an enormous touch screen showing the latest vote results and explains what is happening and why it is interesting. \n\nTypically he is pointing at a map of the country, or a particular state. That map has various counties or districts or shapes colored red and blue. ^[During my time at NBC, the rules about when to color shapes has been debated. House districts are only colored for a particular party when that race has been called (not projected) by the NBC decision desk. This means there is basically no chance it will ever change color. Counties, on the other hand, never technically have a “winner” but a “leader” who has a majority of votes in a particular county. Counties were colored by whoever was leading the votes. Once the first votes came in, if there were 50 for the D and 51 for the R, the county would color for the R.]\n\nThe election data comes in as a big list of states, counties, and districts. A handy way to refer to all of these buckets of votes at once is as a **reporting unit**. \n\nEach reporting unit contains different races. \n\n## Primary elections\nIn addition to the general elections that gather the most attention, parties hold their own elections to decide who will run against the other party, the [primaries](https://en.wikipedia.org/wiki/Primary_election). \n\nThese primaries can take [various forms](https://en.wikipedia.org/wiki/Primary_election#Primaries_in_the_United_States) including: uncontested (no challenger) or runoff/[Louisiana](https://en.wikipedia.org/wiki/Louisiana_primary)/[blanket](https://en.wikipedia.org/wiki/Nonpartisan_blanket_primary). They can be [open or closed, partially open, partially closed, etc…](http://www.ncsl.org/research/elections-and-campaigns/primary-types.aspx) - remember, [edge cases](#Edge-cases).\n\n## Voting machines\n[Voting machine](https://ballotpedia.org/Voting_methods_and_equipment_by_state)^[There are 4 main types of voting machines: **Optical Scan Paper Ballot** (little bubbles you fill out by hand), **Direct Recording Electronic** (computers with touch screens or buttons), **Ballot Marking** (a computer marks paper), and **Punch Card** (voters punch holes and avoid whatever [“hanging chads”](https://en.wikipedia.org/wiki/Chad_(paper)) are)] security in the United States is currently [a joke](https://www.wired.com/story/voting-machine-vulnerabilities-defcon-voting-village/).^[See the reports from the DEFCON Voting Machine Hacking Village in [2018](https://www.defcon.org/images/defcon-26/DEF%20CON%2026%20voting%20village%20report.pdf) and [2017](https://www.defcon.org/images/defcon-25/DEF%20CON%2025%20voting%20village%20report.pdf)] The joke is not funny when you consider the real-world impact of such an important lever of our society left comically unguarded. \n\nThe [OSET Institute](https://www.osetfoundation.org/) has compiled some data and an excellent team to work on the technology used for American elections, including defending from [threats of cyberterrorism](https://www.osetfoundation.org/research/2019/02/10/electioncyberterrorism). \n\n## Coverage of elections\nIn 2018 I did some design research (captured in a [twitter thread](https://twitter.com/mrejfox/status/1021951616482795521?s=20)) and went through some old footage of NBC election coverage. I was even able to incorporate the effect of [numbers counting up](https://twitter.com/mrejfox/status/1021953888411430912) as they changed into the 2018 version of the Big Board. \n\nI had the fortune to join a politics-covering media organization in 2016, a year when suddenly there was intense interest in how media organizations covered politics. Many feel the media failed in the coverage of the 2016 election.\n\nI think it is worthwhile to listen to those criticisms and [think of ways](http://pressthink.org/2018/11/election-coverage-the-road-not-taken/) that things might be improved. \n\nBut we have a rat’s nests of problems to untangle from [horse race](https://en.wikipedia.org/wiki/Horse_race_journalism) coverage (which [might be good!](https://journals.sagepub.com/doi/abs/10.1177/1081180x98003004004)) to televised debates, [election polling](https://www.pewresearch.org/fact-tank/2016/11/09/why-2016-election-polls-missed-their-mark/) methodologies, and the ways polls should be covered. \n\n### Horse race election coverage\nJack Shafer wrote in Politico about why [horse race election coverage might be good](https://www.politico.com/magazine/story/2019/01/09/why-horse-race-political-journalism-awesome-223867). \n\n > By giving voters a window on the closed world of insider politics, horse-race stories help focus reader attention on the races. Without the work of election handicappers, coverage would come to resemble an endless series of policy white papers that nobody reads. The presidential campaign has another 22 months to run, leaving plenty of time and space to explore the contest from multiple perspectives. \n\n### Election night 2000\nAt NBC the old heads would whisper to never fuck up as bad as they did back in 2000. A CNN internal report called their own election night coverage in 2000 [“a disaster”](https://www.nytimes.com/2001/02/03/us/report-calls-networks-election-night-coverage-a-disaster.html).\n\n> Following the election night coverage – in which CNN, ABC, CBS, NBC, Fox and MSNBC all made wrong calls on the Florida vote – several networks ordered investigations of their coverage.\n\n> Based largely on exit polling, the networks first declared Mr. Gore the winner in Florida, only to give the state to Mr. Bush later. Ultimately the networks backed off again, declaring the race undecided.\n\nThe coverage of 2000’s presidential election lead to executives from CBS, CNN, Fox, NBC, and the AP being [called to testify in front of congress](https://www.rcfp.org/networks-answer-congress-election-night-coverage/) by committee chair “Billy” Tauzin (R-La.). \n\n> Much of the testimony focused on the networks’ reliance on exit polls and the flaws in the VNS system of conducting the polls.\n\n> Tauzin introduced legislation to create a uniform poll closing time across the country and asked the networks to voluntarily resist projecting winners until 9 p.m. EST. In a concession, all the networks said they will refrain from calling a state until all the polls in the particular state have closed.\n\n## Why do we have elections on Tuesdays?\nIt could be argued that it would make more sense for elections to be held [on the weekend](https://www.congress.gov/bill/112th-congress/house-bill/4183/text). \n\n[Erin McCarthy wrote for Mentalfloss:](https://mentalfloss.com/article/12901/why-are-elections-held-tuesdays)\n> Monday was out, because it would require people to travel to the polls by buggy on the Sunday Sabbath. Wednesday was also not an option, because it was market day, and farmers wouldn’t be able to make it to the polls. So it was decided that Tuesday would be the day that Americans would vote in elections, and in 1845, Congress passed a law.\n\n## Resources\n+ [Ballotpedia](https://ballotpedia.org/) is an exceptional source of all of the strange little constantly-changing details about elections, --freely editable like Wikipedia-- edited by [Ballotpedia staff](https://ballotpedia.org/Ballotpedia:Staff). \n+ [election-geodata](https://github.com/nvkelso/election-geodata) is a great collection of geographic precinct shape data for mapping election results. \n+ [OpenElections](http://www.openelections.net/) is an open-source project made to create a “free, comprehensive, standardized, linked set of election data for the United States, including federal and statewide offices” which is a pretty incredible goal if you ask me. \n+ [270toWin](https://www.270towin.com/historical-presidential-elections/) has great maps and information on historical elections.",
  "bodyHtml": "<h1>Things I've learned about elections</h1>\n<h2>Edge cases</h2>\n<p>Elections are all edge cases. Votes are cast and tallied by a wide variety of Americans who all have the same goal but often different ideas about how to go about it. Votes are cast in cities and rural areas, in places with millions of constituents or dozens. Many elections are run locally by someone you should mentally picture as your well-meaning aunt. The sheer scale of such an operation is astounding. We live in a country that spans a continent and <a href=\"https://en.wikipedia.org/wiki/File:US-Timezones-post-2007.png\">9 time zones</a>.</p>\n<p>This great country contains lots of different people with lots of different ways of going about things.</p>\n<p>[[toc]]</p>\n<p>The basic rules around voting are laid out in the constitution^[<a href=\"https://constitutioncenter.org/interactive-constitution/articles/article-i#elections-clause\">Article 1 of the Constitution</a> “The House of Representatives shall be composed of Members chosen every second Year by the People of the several States…” - <a href=\"https://www.usconstitution.net/xconst_A1Sec4.html\">Section 4</a>: “The Times, Places and Manner of holding Elections for Senators and Representatives, shall be prescribed in each State by the Legislature thereof; but the Congress may at any time by Law make or alter such Regulations, except as to the Places of chusing Senators.”] but a remarkable amount of the nitty-gritty details are <a href=\"https://www.brennancenter.org/analysis/voting-laws-roundup-2019\">left up to each state</a> to figure out.</p>\n<p>On election day in America, polls open at a particular time and close at a particular time. Those times, like almost everything else, <a href=\"https://ballotpedia.org/State_Poll_Opening_and_Closing_Times_(2019)\">depend on where you’re talking about</a> and can vary even within a single state and could change any year.</p>\n<p>We have grown accustomed to live results of elections. This is definitely not something our grandfathers had and is mind-bogglingly complex once you start to think about it.</p>\n<p>With American elections “live” does not mean getting the results of votes immediately after they are cast. The closest we can get for now is seeing vote results as they are counted after polls close. ^[This makes sense, when you think about it. There is reason to believe if you could turn on your TV and see how your candidate was doing, if you could see the vote counts live and your candidate was safely ahead, you might decide it’s not even worth going out and casting a vote.]</p>\n<h2>Races</h2>\n<p>Any particular office (be it a Senate or a President or local Sheriff) has a variety of candidates from a variety of parties. Generally we think of races as between two front runners, but people often vote for third parties or <a href=\"https://en.wikipedia.org/wiki/Write-in_candidate\">write in candidate’s names</a> and those votes need to be accounted for.</p>\n<p>Here’s what we can agree on: A <strong>race</strong> is run by <em>n</em> number of <strong>candidates</strong> for a single <strong>office</strong>.</p>\n<p>You might say &quot;at least we can assume the candidates are human&quot; - but <a href=\"https://en.wikipedia.org/wiki/Non-human_electoral_candidates\">you would be wrong</a>. Never assume in elections.</p>\n<p>Every <a href=\"https://en.wikipedia.org/wiki/Voting_rights_in_the_United_States\">eligible(!)</a> person who lives in the area that candidate <a href=\"https://ballotpedia.org/Who_represents_me\">represents</a> (districts for the house, states for senators, the entire country for presidents) gets to vote between the candidates running for each office that represents them. ^[The election of Senators was not always given to the population in general. The framer’s constitution <a href=\"https://www.senate.gov/artandhistory/history/common/generic/Feature_Homepage_ElectedStateLegislatures.htm\">left that to the states</a>. “The framers believed that in electing senators, state legislatures would cement their ties with the national government. They also expected that senators elected by state legislatures would be freed from pressures of public opinion and therefore better able to concentrate on legislative business and serve the needs of each state. In essence, senators would serve as “states’ ambassadors” to the federal government.” - it turned out to not work well because states never got around to electing them.]</p>\n<h2>Voting</h2>\n<p>Constituents show up to their polling place. Or, well, <a href=\"http://www.ncsl.org/research/elections-and-campaigns/absentee-and-early-voting.aspx\">sort of</a>. <a href=\"http://www.ncsl.org/research/elections-and-campaigns/absentee-and-early-voting.aspx#overview\">39 states</a> have mechanisms for early voting, 28 allow no-excuse absentee votes, 19 allow voting with an “accepted excuse”. <a href=\"https://www.politico.com/story/2018/11/05/early-voting-turnout-2018-elections-midterms-963149\">36 million people voted early in the midterm election.</a> - that’s about 30% of the <a href=\"http://www.electproject.org/2018g\">117 million</a> total votes cast.</p>\n<p>When reporting votes, absentee votes are typically only available at the county-level and not be precinct.</p>\n<h3>Voter Registration</h3>\n<p>In order to vote, an eligible potential voter must register. Voter registration is handled by government officials on the county and state level.</p>\n<p>Once registered on voter records, voters can be removed for any of the following reason:\nVoters can be removed from records for a few reasons:</p>\n<ul>\n<li>Disenfranchising criminal conviction</li>\n<li>Mental incapacity</li>\n<li>Death</li>\n<li>Change in residence</li>\n<li>Never eligible: under 18 or noncitizen</li>\n<li>Voter self-requests removal</li>\n</ul>\n<h3>Voting systems</h3>\n<ul>\n<li><a href=\"https://en.wikipedia.org/wiki/First_past_the_post\">First past the post</a> is what most people think of. Voters mark a ballot with the candidate they want to win, and the candidate who receives the most votes wins.</li>\n<li><a href=\"https://en.wikipedia.org/wiki/Two-round_system\">Runoff voting</a> works similarly, but there is a minimum amount of votes required. If no candidate exceeds that minimum, some candidates are eliminated and a second round of the election is held (usually with the top 2 ranked candidates).</li>\n<li>A <a href=\"https://en.wikipedia.org/wiki/Louisiana_primary\">Louisiana primary</a> is similar to an <a href=\"https://ballotpedia.org/Open_primary\">open primary</a> where all candidates running for an office appear together on the same ballot, including multiples per party (instead of a party picking a single candidate to run in a race). The race goes to runoff if no candidate wins by simple majority.</li>\n<li>Maine is the first U.S. state to enact <a href=\"https://en.wikipedia.org/wiki/Instant-runoff_voting\">instant-runoff or “ranked choice” voting</a>^[A variety of <a href=\"https://en.wikipedia.org/wiki/Instant-runoff_voting_in_the_United_States\">major U.S. cities</a> use ranked choice voting for local elections.] Instead of voting for one candidate over another, voters rank the candidates in order of preference.</li>\n</ul>\n<p><img src=\"//ej-fox.s3.amazonaws.com/blog/maine-ranked-choice-ballot.png\" alt=\"Maine ranked-choice voting ballot\"></p>\n<p>The Center for Civic Design has a <a href=\"https://civicdesign.org/fieldguides/designing-usable-ballots/\">great guide</a> for designing ballots so they are usable, which <a href=\"https://www.propublica.org/article/disenfranchised-by-bad-design\">they are often not</a>.</p>\n<h2>Reporting units</h2>\n<p>The term “reporting unit” can refer to a boundary division of any size used to aggregate votes in an election. This can be a <a href=\"https://en.wikipedia.org/wiki/New_England_town\">town</a>, <a href=\"https://en.wikipedia.org/wiki/List_of_parishes_in_Louisiana\">parish</a>, <a href=\"https://www.nytimes.com/interactive/2018/upshot/election-2016-voting-precinct-maps.html\">precinct</a>, county, <a href=\"https://www.policymap.com/2015/09/county-subdivisions-the-secret-geography/\">county sub-division</a> or state.</p>\n<p>Presidential, senate, and gubernatorial races are organized by county and state.</p>\n<p>House races are organized by house districts. The borders of these house districts are <a href=\"https://ballotpedia.org/State-by-state_redistricting_procedures\">primarily decided by state legislatures</a> but some &lt;small&gt;(AZ, CA, ID, WA)&lt;/small&gt; are made by independent commissions. <a href=\"https://projects.fivethirtyeight.com/redistricting-maps/\">538 did an excellent piece</a> on congressional redistricting and gerrymandering.</p>\n<h2>Election data</h2>\n<p>Once a vote is cast, ballots are counted and the counts are delivered to a central location and the numbers are reported in regular intervals (usually). That is all handled by state and local governments, often by county and state boards of elections.</p>\n<p>The media (and by extension, the public) are given access to the vote counts at this point. Often times you can find a website run by the Secretary of State which will have the latest results for different statewide elections. Data services will pay reporters or <a href=\"https://news.ycombinator.com/item?id=12912528\">stringers</a> to go to the places where votes are counted to and send the results back to competing data services which then resell that data to news organizations (live election results are not cheap).</p>\n<p>Election day vote and <a href=\"https://ballotpedia.org/Exit_polling\">exit poll</a> <a href=\"https://www.pewresearch.org/fact-tank/2016/11/02/just-how-does-the-general-election-exit-poll-work-anyway/\">result data</a> is provided to ABC, CBS, CNN, and NBC News in a consortium called the <strong>National Election Pool</strong>. The data is fed by <a href=\"https://www.edisonresearch.com/election-polling/\">Edison Research</a>.</p>\n<p>Alternatives for live data include <a href=\"https://decisiondeskhq.com/\">Decision Desk HQ</a> or the <a href=\"https://developer.ap.org/ap-elections-api/\">AP Elections API</a>.</p>\n<p>Historical data can be found from the above sources as well as from <a href=\"https://electionlab.mit.edu/data\">MIT</a> or <a href=\"http://www.openelections.net/\">OpenElections</a>. <a href=\"https://www.mapbox.com/elections\">MapBox</a> also has pre-bound boundaries with historical data.</p>\n<p>County-level presidential results 2008-2016 have been <a href=\"https://github.com/tonmcg/US_County_Level_Election_Results_08-16\">collected in this GitHub repo</a></p>\n<h3>Geographic Identifiers: FIPS Codes</h3>\n<p>States can be identified via their name (<code>New York</code>), <a href=\"https://gist.github.com/mshafrir/2646763\">abbreviation</a> (<code>NY</code>), or a state FIPS code  (<a href=\"https://www.mcc.co.mercer.pa.us/dps/state_fips_code_listing.htm\">36</a>).</p>\n<p>House districts are identified by their district code. New York’s first district is <code>NY-01</code>. Large states with smaller populations like <a href=\"https://en.wikipedia.org/wiki/Montana%27s_at-large_congressional_district\">Montana</a> have only one congressional district (“at large”), denoted like <code>MT-AL</code>.</p>\n<p>I’ve seen various systems handle this different ways. Some designate these districts with <code>MT-00</code> so at least you can rely on two numeric digits when writing your code.</p>\n<p>Counties are identified by <a href=\"https://en.wikipedia.org/wiki/List_of_United_States_FIPS_codes_by_county\">county FIPS codes</a>. The first two numbers of a county FIPS code are the state code, which is handy.</p>\n<h3>Mapping live election results</h3>\n<p>At NBC the Big Board is commanded by Steve Kornacki, who is the best in the business if you ask me. He stands by an enormous touch screen showing the latest vote results and explains what is happening and why it is interesting.</p>\n<p>Typically he is pointing at a map of the country, or a particular state. That map has various counties or districts or shapes colored red and blue. ^[During my time at NBC, the rules about when to color shapes has been debated. House districts are only colored for a particular party when that race has been called (not projected) by the NBC decision desk. This means there is basically no chance it will ever change color. Counties, on the other hand, never technically have a “winner” but a “leader” who has a majority of votes in a particular county. Counties were colored by whoever was leading the votes. Once the first votes came in, if there were 50 for the D and 51 for the R, the county would color for the R.]</p>\n<p>The election data comes in as a big list of states, counties, and districts. A handy way to refer to all of these buckets of votes at once is as a <strong>reporting unit</strong>.</p>\n<p>Each reporting unit contains different races.</p>\n<h2>Primary elections</h2>\n<p>In addition to the general elections that gather the most attention, parties hold their own elections to decide who will run against the other party, the <a href=\"https://en.wikipedia.org/wiki/Primary_election\">primaries</a>.</p>\n<p>These primaries can take <a href=\"https://en.wikipedia.org/wiki/Primary_election#Primaries_in_the_United_States\">various forms</a> including: uncontested (no challenger) or runoff/<a href=\"https://en.wikipedia.org/wiki/Louisiana_primary\">Louisiana</a>/<a href=\"https://en.wikipedia.org/wiki/Nonpartisan_blanket_primary\">blanket</a>. They can be <a href=\"http://www.ncsl.org/research/elections-and-campaigns/primary-types.aspx\">open or closed, partially open, partially closed, etc…</a> - remember, <a href=\"#Edge-cases\">edge cases</a>.</p>\n<h2>Voting machines</h2>\n<p><a href=\"https://ballotpedia.org/Voting_methods_and_equipment_by_state\">Voting machine</a>^[There are 4 main types of voting machines: <strong>Optical Scan Paper Ballot</strong> (little bubbles you fill out by hand), <strong>Direct Recording Electronic</strong> (computers with touch screens or buttons), <strong>Ballot Marking</strong> (a computer marks paper), and <strong>Punch Card</strong> (voters punch holes and avoid whatever <a href=\"https://en.wikipedia.org/wiki/Chad_(paper)\">“hanging chads”</a> are)] security in the United States is currently <a href=\"https://www.wired.com/story/voting-machine-vulnerabilities-defcon-voting-village/\">a joke</a>.^[See the reports from the DEFCON Voting Machine Hacking Village in <a href=\"https://www.defcon.org/images/defcon-26/DEF%20CON%2026%20voting%20village%20report.pdf\">2018</a> and <a href=\"https://www.defcon.org/images/defcon-25/DEF%20CON%2025%20voting%20village%20report.pdf\">2017</a>] The joke is not funny when you consider the real-world impact of such an important lever of our society left comically unguarded.</p>\n<p>The <a href=\"https://www.osetfoundation.org/\">OSET Institute</a> has compiled some data and an excellent team to work on the technology used for American elections, including defending from <a href=\"https://www.osetfoundation.org/research/2019/02/10/electioncyberterrorism\">threats of cyberterrorism</a>.</p>\n<h2>Coverage of elections</h2>\n<p>In 2018 I did some design research (captured in a <a href=\"https://twitter.com/mrejfox/status/1021951616482795521?s=20\">twitter thread</a>) and went through some old footage of NBC election coverage. I was even able to incorporate the effect of <a href=\"https://twitter.com/mrejfox/status/1021953888411430912\">numbers counting up</a> as they changed into the 2018 version of the Big Board.</p>\n<p>I had the fortune to join a politics-covering media organization in 2016, a year when suddenly there was intense interest in how media organizations covered politics. Many feel the media failed in the coverage of the 2016 election.</p>\n<p>I think it is worthwhile to listen to those criticisms and <a href=\"http://pressthink.org/2018/11/election-coverage-the-road-not-taken/\">think of ways</a> that things might be improved.</p>\n<p>But we have a rat’s nests of problems to untangle from <a href=\"https://en.wikipedia.org/wiki/Horse_race_journalism\">horse race</a> coverage (which <a href=\"https://journals.sagepub.com/doi/abs/10.1177/1081180x98003004004\">might be good!</a>) to televised debates, <a href=\"https://www.pewresearch.org/fact-tank/2016/11/09/why-2016-election-polls-missed-their-mark/\">election polling</a> methodologies, and the ways polls should be covered.</p>\n<h3>Horse race election coverage</h3>\n<p>Jack Shafer wrote in Politico about why <a href=\"https://www.politico.com/magazine/story/2019/01/09/why-horse-race-political-journalism-awesome-223867\">horse race election coverage might be good</a>.</p>\n<blockquote>\n<p>By giving voters a window on the closed world of insider politics, horse-race stories help focus reader attention on the races. Without the work of election handicappers, coverage would come to resemble an endless series of policy white papers that nobody reads. The presidential campaign has another 22 months to run, leaving plenty of time and space to explore the contest from multiple perspectives.</p>\n</blockquote>\n<h3>Election night 2000</h3>\n<p>At NBC the old heads would whisper to never fuck up as bad as they did back in 2000. A CNN internal report called their own election night coverage in 2000 <a href=\"https://www.nytimes.com/2001/02/03/us/report-calls-networks-election-night-coverage-a-disaster.html\">“a disaster”</a>.</p>\n<blockquote>\n<p>Following the election night coverage – in which CNN, ABC, CBS, NBC, Fox and MSNBC all made wrong calls on the Florida vote – several networks ordered investigations of their coverage.</p>\n</blockquote>\n<blockquote>\n<p>Based largely on exit polling, the networks first declared Mr. Gore the winner in Florida, only to give the state to Mr. Bush later. Ultimately the networks backed off again, declaring the race undecided.</p>\n</blockquote>\n<p>The coverage of 2000’s presidential election lead to executives from CBS, CNN, Fox, NBC, and the AP being <a href=\"https://www.rcfp.org/networks-answer-congress-election-night-coverage/\">called to testify in front of congress</a> by committee chair “Billy” Tauzin (R-La.).</p>\n<blockquote>\n<p>Much of the testimony focused on the networks’ reliance on exit polls and the flaws in the VNS system of conducting the polls.</p>\n</blockquote>\n<blockquote>\n<p>Tauzin introduced legislation to create a uniform poll closing time across the country and asked the networks to voluntarily resist projecting winners until 9 p.m. EST. In a concession, all the networks said they will refrain from calling a state until all the polls in the particular state have closed.</p>\n</blockquote>\n<h2>Why do we have elections on Tuesdays?</h2>\n<p>It could be argued that it would make more sense for elections to be held <a href=\"https://www.congress.gov/bill/112th-congress/house-bill/4183/text\">on the weekend</a>.</p>\n<p><a href=\"https://mentalfloss.com/article/12901/why-are-elections-held-tuesdays\">Erin McCarthy wrote for Mentalfloss:</a></p>\n<blockquote>\n<p>Monday was out, because it would require people to travel to the polls by buggy on the Sunday Sabbath. Wednesday was also not an option, because it was market day, and farmers wouldn’t be able to make it to the polls. So it was decided that Tuesday would be the day that Americans would vote in elections, and in 1845, Congress passed a law.</p>\n</blockquote>\n<h2>Resources</h2>\n<ul>\n<li><a href=\"https://ballotpedia.org/\">Ballotpedia</a> is an exceptional source of all of the strange little constantly-changing details about elections, --freely editable like Wikipedia-- edited by <a href=\"https://ballotpedia.org/Ballotpedia:Staff\">Ballotpedia staff</a>.</li>\n<li><a href=\"https://github.com/nvkelso/election-geodata\">election-geodata</a> is a great collection of geographic precinct shape data for mapping election results.</li>\n<li><a href=\"http://www.openelections.net/\">OpenElections</a> is an open-source project made to create a “free, comprehensive, standardized, linked set of election data for the United States, including federal and statewide offices” which is a pretty incredible goal if you ask me.</li>\n<li><a href=\"https://www.270towin.com/historical-presidential-elections/\">270toWin</a> has great maps and information on historical elections.</li>\n</ul>\n",
  "title": "Things I've learned about elections",
  "dir": "content/blog/posts",
  "base": "things-ive-learned-about-elections.json",
  "ext": ".json",
  "sourceBase": "things-ive-learned-about-elections.md",
  "sourceExt": ".md"
}