{
  "title": "Things I've learned about elections",
  "dek": "In which we discover the knotted beauty of American democracy",
  "body": "# Things I’ve learned about elections and making maps of them\n\n#### Edge cases\n\nElections are all edge cases. Votes are cast and tallied by a wide variety of Americans who all have the same goal but often different ideas about how to go about it. Votes are cast in cities and rural areas, in places with millions of constituents or dozens. Many elections are run locally by someone you should mentally picture as your well-meaning aunt. The sheer scale of such an operation is astounding if you’ve ever driven across the United States ocean-to-ocean. \n\nFlying gets close but does not completely convey the extent that we live in a country that spans a continent and contains lots of different people with lots of different ways about going things. \n\n## Election day\nAs voters, we have grown accustomed to live results of an important election. This is definitely something our grandfathers had, and is mind-boggling complex once you start to think about it. In any case, which American elections, “live” does not mean getting the results of votes immediately after they are cast. \n\nThe basic rules around voting are laid out in the constitution[^1] but a remarkable amount of the nitty-gritty details are left up to each state to figure out. \n\nOn election day in America, polls open at a particular time and close at a particular time. Those times, like almost everything else, depend on where you’re talking about. \n\n### Races\nAny particular office (be it a Senate or a President or local Sheriff) has a variety of candidates from a variety of parties. Generally we think of them as races between two front runners. But this is more a matter of culture and simplification than reality. \n\nAbstracting a bit, A **race** is run by *n* number of **candidates** for a single **office**.[^2] \n\nEvery [eligible](https://en.wikipedia.org/wiki/Voting_rights_in_the_United_States) person who lives in the area that person represents (districts for the house, states for senators, the entire country for presidents) gets to vote between the candidates running for each office that represents them. [^4]\n\nFor example the [2016 Presidential Race](https://ballotpedia.org/Presidential_election,_2016) had four[^3] candidates; Clinton (D), Trump (R), Stein (G), and Johnson (L) running for the office of president.\n\n### Voting\nConstituents show up to their polling place. Or, well, [sort of](http://www.ncsl.org/research/elections-and-campaigns/absentee-and-early-voting.aspx). [39 states](http://www.ncsl.org/research/elections-and-campaigns/absentee-and-early-voting.aspx#overview) have mechanisms for early voting, 28 allow no-excuse absentee votes, 19 allow voting with an accepted excuse. [36 million people voted early in the midterm election.](https://www.politico.com/story/2018/11/05/early-voting-turnout-2018-elections-midterms-963149) \n\n### Primary elections\nIn addition to the general elections that gather the most attention, parties hold their own elections to decide who will run against the other party, the [primaries](https://en.wikipedia.org/wiki/Primary_election). \n\nThese primaries can take [various forms](https://en.wikipedia.org/wiki/Primary_election#Primaries_in_the_United_States) including: uncontested (no challenger) or runoff/[Louisiana](https://en.wikipedia.org/wiki/Louisiana_primary)/[blanket](https://en.wikipedia.org/wiki/Nonpartisan_blanket_primary). They can be [open or closed, partially open, partially closed, etc…](http://www.ncsl.org/research/elections-and-campaigns/primary-types.aspx) - remember, [edge cases](#edge-cases).\n\n### Voting machines\nThe [OSET Institute](https://www.osetfoundation.org/) has compiled some data and an excellent team to work on the technology used for American elections, including defending from [threats of cyberterrorism](https://www.osetfoundation.org/research/2019/02/10/electioncyberterrorism). \n\n\n\n\n\n[^1]: [Article 1 of the Constitution](https://constitutioncenter.org/interactive-constitution/articles/article-i#elections-clause) “The House of Representatives shall be composed of Members chosen every second Year by the People of the several States…” - [Section 4](https://www.usconstitution.net/xconst_A1Sec4.html): “The Times, Places and Manner of holding Elections for Senators and Representatives, shall be prescribed in each State by the Legislature thereof; but the Congress may at any time by Law make or alter such Regulations, except as to the Places of chusing Senators.”\n\n[^2]: Well, sort of, remember what I said about [edge cases](#edge-cases)? There are four more additional candidates who [“made more than 15 percent of general election ballots”](https://ballotpedia.org/Presidential_candidates,_2016#Candidates_by_state_primary_ballot) \n\n[^3]: Four additional candidates appeared on some ballots but not all: Darrell Lane Castle (Constitution Party), Rocky De La Fuente (Reform Party), Evan McMullin (Independent), Gloria Estela La Riva (Party for Socialism and Liberation)\n\n[^4]: The election of Senators was not always given to the population in general. The framer’s constitution left that to the states. [“The framers believed that in electing senators, state legislatures would cement their ties with the national government. They also expected that senators elected by state legislatures would be freed from pressures of public opinion and therefore better able to concentrate on legislative business and serve the needs of each state. In essence, senators would serve as “states’ ambassadors” to the federal government.”](https://www.senate.gov/artandhistory/history/common/generic/Feature_Homepage_ElectedStateLegislatures.htm) - it turned out to not work well because states never got around to electing them. ",
  "type": "words",
  "hidden": false,
  "inprogress": true,
  "date": "2019-06-01T23:53:38.761Z",
  "hidetimestamp": false
}