{
  "dek": "In which the author works to define the Yin and Yang of New York– the history of oscillation between upstate (rural) and the city (urban)",
  "type": "words",
  "hidden": true,
  "inprogress": false,
  "date": "2019-08-02T12:17:00-04:00",
  "hidetimestamp": false,
  "bodyContent": "# Finding balance\n\nI’m smoking a new strain this morning. In my experiment with reducing my intake of internet and increasing my intake of books I decided to find the book on my shelf with large photographs of beautiful cannabis buds and descriptions of their lineage. \n\nThe zip loc bag full of beautiful green flowers in front of me is labeled “G-13, 1/2”. I flip my book past D, E, and F, slowing down at G and finding my desired page describing the half ounce I purchased a few days ago. \n\nG-13 is a strain, it is said, originally developed by the government. This is likely apocryphal, reinforced by an excellent mock-historical scene in the movie Pineapple Express. My book describes it as a “rare daytime indica”. \n\nThis is interesting because I was  having a conversation with a friend of mine on my stoop last night about that particular thing. I had taken the train back down from the Hudson Valley where I had spent the weekend for a friend’s annual birthday party held in a beautiful remote corner of Orange County where you are surrounded by lush green fields and woods you could spend a lifetime exploring. \n\nBack in Brooklyn, carrying a heavy backpack with everything I need to live and sleep for a while plus a tote bag of books I had purchased at the Newburgh Barnes & Noble. \n\nI finally made it home and walked eagerly to my front door, sprawling my heavy bags aside to free my hands to grab my keys. At that moment, I realized that my apartment keys were sitting nearly 100 miles away on the dashboard of my Honda Element parked in the driveway of my parent’s house. \n\nNormally I have prepared secretive entry methods in case of this particular emergency. I could, of course, wait for my neighbors to come home and let me into the backyard where I have prepared additional secretive entry methods- but our last conversation was my displeasure at their sound levels which ultimately concluded in the landlord sending them an email to either be quieter or have their beautiful hardwood floors reduced to carpeting. They have been quieter since, but I notice them slowly increasing the default volume of the stereo on which they place hideously bad country music with plodding aimless basslines that occasionally pervade my apartment, filling me with misguided rage. I am disinclined to ask them for a favor unless I really need to at this point. \n\nLuckily for me, I had given my friend my spare keys and some cash to feed my cat a few upstate-adventures ago – and double luckily – she was going to be home shortly. I assembled my collection of baggage at my door. I remembered a tiny bottle of leftover weed from my trip – a rarity – dug through my bag and sat on my stoop rolling a spliff while I waited. \n\nI’ve lived in this same Brooklyn neighborhood for 5 years now, and 3 at this apartment on my own. But I had never smoked a spliff on my stoop before – an astounding stat to anyone with even cursory knowledge of my habits and personality. Perhaps it was because they both had backyards making it feel redundant and needlessly intrusive. But in my heart, I knew the truth was I didn’t feel comfortable yet. \n\nI didn’t want to risk annoying anyone, particularly any new neighbors. But as I sat on my stoop on one of the most beautiful nights we have seen yet this summer, the timing, temperature, mood, and circumstances aligned and it finally felt right. A few neighbors walked by and nodded hello, smiling. Alright.\n\nMy friend Kayla arrived and gave me the spare keys, and we sat for a while chatting. We grew up upstate together, teenagers similarly frustrated at the small town we grew up in and delighted by the ska punk shows our friends would put on at the local coffee shops and a large building named Townley Hall which was owned by the town and was primarily used by the volunteer firefighters to throw huge events and fundraisers, renting it out for a fee. Kayla and I remarked on how we had ended up living not far from each other in Brooklyn- fortuitous and synchronous. Perhaps not entirely coincidental, considering how small the world truly is and the ways that people who think similarly are invisibly magnetized to each other in conscious and unconscious ways. \n\nOn this night these forces had aligned to bring me my apartment keys when I desperately needed them, carrying an absurd amount of bags and exhausted from a drive upstate, 2 days of partying, and the triple-train-journey required to get from Middletown to Secaucus, Secaucus to Penn Station, then 34th St. to Myrtle Ave in Brooklyn. \n\nKayla had been straight edge for most of the time I’d known her, but had recently begun smoking weed for the first time and wanted to share her new experiences, knowing me as a practitioner of the cannabis arts for quite a while. She had been very thoughtfully exploring the different chemistries of strains, and the ways in which certain indicas or sativas can create wildly different experiences. She told me she had been enjoying indicas- noticing a relaxation in the body but clarity in the mind, not rushing thoughts or anxiety like some sativas can produce. The whole world is experimenting with CBD now, I can get it in my morning coffee for an extra dollar (but never do).  \n\nMany people say that the weed our parents and ancestors smoked had a ratio of 1:1 THC/CBDs, when weed was grown in patches between property lines and not by genius-level stoners with magnifying glasses and specialized lights. But as generations of towering green buds were cultivated to get us higher and higher, the ratio fell out of balance. This lead to strains that can get you magnificently high, but for the inexperienced can lead to anxiety- the anchor of CBD having been removed, or at least not cultivated at the right ratio. For many this leads to a simplified understanding of “the weed now is too strong for me”. But we are all learning every day. \n\nI gave Kayla a small sampling of G-13, writing the name on a bottle. “Give this a try!” I said, curious to see her experience of one of the best indicas I have ever had, that I happened to have gotten from the luck of the draw. It’s funny how things line up sometimes. \n\n—\n\nFor the past few days I’ve been looking for a term that reflects the Yin and Yang of upstate and the city. For me personally, happiness lies somewhere in the mixture of those things. The correct appreciation and ratio, too much of one liable to drive a person mad. Or at least me. \n\nI am looking for a name for it because I know this is not a new concept. I grew up in a town over from a former railroad town, once-booming. It became a combination of rural and commuter, home to many who took the train or masochistically drove back and forth from the city every day. Many were current or retired cops and firefighters from the city, and I have a vivid early memories of dads and coaches in my little league who were no longer around after 9/11. That and the huge new flagpole and plaque they installed near the entrance to the baseball fields. \n\nThese people had grown up in the city, or at least spent their professional lives there. Cops get a unique tour through the most dramatic moments of people’s lives in any city or town. There is no need for me to reiterate the stories I have heard of dangerous pre-Giuliani New York and the wondrous delights, desperation, and gore any New York cop or firefighter must see often enough to be routine.\n\nOne powerful antidote to such strong doses of the human condition that was found many generations ago is to go upstate and spend some time in the woods until the thoughts rattling around your head don’t sound so loud. \n\nWhat is the name for that?\n\n—\n\nOne form of meditation that I have been studying (or exposed to, depending on your assessment of my discipline) is where you sit with your back straight and focus on your breath. Thoughts, as they are wont to do, cross your mind and present themselves for your indulgence. The point of this meditation is to see those thoughts say, “okay, thought”, and then let it pass and focus on your breathing. You are not suppressing or ignoring, you are acknowledging and refocusing. \n\nIn the summers my mom runs a nature camp upstate. Through a state program every year a scholarship is given to a few kids in low-income neighborhoods to come upstate and stay with a family and attend a summer camp in the woods, like my mom’s. A lot of people from the city had never seen things we took for granted like pastures of cows, the strong smell of manure, and all sorts of spiders, bugs, snakes, flies, wasps, bees, and mosquitos. \n\nYou learn a lot about someone when you are sitting, chatting, sipping on some juice and a bee flies on over. The way I was raised, the correct reaction is no reaction. This is true for many (but not all) encounters with wildlife. But a lot of kids, faced with this situation for the first time would scream, cover their faces, or even try to swat the bee away. Bees, unlike wasps, only get one opportunity to sting in their lives. When a bee stings you, it is their final act, a martyrdom for their queen. A bee has to kill itself to mildly annoy you, and with stakes as they are, it is much more reasonable to let it do some low-altitude flybys of your head as you remark on it’s aggressive attitude. Maybe it wants a sip of your ridiculous cup of manmade sugar that bees would be laughed out of their colonies if they suggested existed. \n\nThe same is true of spiders, who are so plentiful that if you went into a fit every time you saw one you would die from exhaustion. These little lessons are repeated infinitely, hourly in the woods, but one can go their whole lives never encountering them growing up in Manhattan. The ratios and balance is all out of whack. \n\nCities, wondrous advancements of civilization that they are, are inarguably an assault on the senses in such sustained totality that is overwhelms the human mind in ways that it did not prepare for in it’s previous life of managing a body responsible for hanging from trees and chasing bison or whatever. \n\nTime spent standing on a busy corner in midtown Manhattan needs to be offset with time sitting in the middle of a quiet forest - at a ratio I have not yet determined.",
  "bodyHtml": "<h1>Finding balance</h1>\n<p>I’m smoking a new strain this morning. In my experiment with reducing my intake of internet and increasing my intake of books I decided to find the book on my shelf with large photographs of beautiful cannabis buds and descriptions of their lineage.</p>\n<p>The zip loc bag full of beautiful green flowers in front of me is labeled “G-13, 1/2”. I flip my book past D, E, and F, slowing down at G and finding my desired page describing the half ounce I purchased a few days ago.</p>\n<p>G-13 is a strain, it is said, originally developed by the government. This is likely apocryphal, reinforced by an excellent mock-historical scene in the movie Pineapple Express. My book describes it as a “rare daytime indica”.</p>\n<p>This is interesting because I was  having a conversation with a friend of mine on my stoop last night about that particular thing. I had taken the train back down from the Hudson Valley where I had spent the weekend for a friend’s annual birthday party held in a beautiful remote corner of Orange County where you are surrounded by lush green fields and woods you could spend a lifetime exploring.</p>\n<p>Back in Brooklyn, carrying a heavy backpack with everything I need to live and sleep for a while plus a tote bag of books I had purchased at the Newburgh Barnes &amp; Noble.</p>\n<p>I finally made it home and walked eagerly to my front door, sprawling my heavy bags aside to free my hands to grab my keys. At that moment, I realized that my apartment keys were sitting nearly 100 miles away on the dashboard of my Honda Element parked in the driveway of my parent’s house.</p>\n<p>Normally I have prepared secretive entry methods in case of this particular emergency. I could, of course, wait for my neighbors to come home and let me into the backyard where I have prepared additional secretive entry methods- but our last conversation was my displeasure at their sound levels which ultimately concluded in the landlord sending them an email to either be quieter or have their beautiful hardwood floors reduced to carpeting. They have been quieter since, but I notice them slowly increasing the default volume of the stereo on which they place hideously bad country music with plodding aimless basslines that occasionally pervade my apartment, filling me with misguided rage. I am disinclined to ask them for a favor unless I really need to at this point.</p>\n<p>Luckily for me, I had given my friend my spare keys and some cash to feed my cat a few upstate-adventures ago – and double luckily – she was going to be home shortly. I assembled my collection of baggage at my door. I remembered a tiny bottle of leftover weed from my trip – a rarity – dug through my bag and sat on my stoop rolling a spliff while I waited.</p>\n<p>I’ve lived in this same Brooklyn neighborhood for 5 years now, and 3 at this apartment on my own. But I had never smoked a spliff on my stoop before – an astounding stat to anyone with even cursory knowledge of my habits and personality. Perhaps it was because they both had backyards making it feel redundant and needlessly intrusive. But in my heart, I knew the truth was I didn’t feel comfortable yet.</p>\n<p>I didn’t want to risk annoying anyone, particularly any new neighbors. But as I sat on my stoop on one of the most beautiful nights we have seen yet this summer, the timing, temperature, mood, and circumstances aligned and it finally felt right. A few neighbors walked by and nodded hello, smiling. Alright.</p>\n<p>My friend Kayla arrived and gave me the spare keys, and we sat for a while chatting. We grew up upstate together, teenagers similarly frustrated at the small town we grew up in and delighted by the ska punk shows our friends would put on at the local coffee shops and a large building named Townley Hall which was owned by the town and was primarily used by the volunteer firefighters to throw huge events and fundraisers, renting it out for a fee. Kayla and I remarked on how we had ended up living not far from each other in Brooklyn- fortuitous and synchronous. Perhaps not entirely coincidental, considering how small the world truly is and the ways that people who think similarly are invisibly magnetized to each other in conscious and unconscious ways.</p>\n<p>On this night these forces had aligned to bring me my apartment keys when I desperately needed them, carrying an absurd amount of bags and exhausted from a drive upstate, 2 days of partying, and the triple-train-journey required to get from Middletown to Secaucus, Secaucus to Penn Station, then 34th St. to Myrtle Ave in Brooklyn.</p>\n<p>Kayla had been straight edge for most of the time I’d known her, but had recently begun smoking weed for the first time and wanted to share her new experiences, knowing me as a practitioner of the cannabis arts for quite a while. She had been very thoughtfully exploring the different chemistries of strains, and the ways in which certain indicas or sativas can create wildly different experiences. She told me she had been enjoying indicas- noticing a relaxation in the body but clarity in the mind, not rushing thoughts or anxiety like some sativas can produce. The whole world is experimenting with CBD now, I can get it in my morning coffee for an extra dollar (but never do).</p>\n<p>Many people say that the weed our parents and ancestors smoked had a ratio of 1:1 THC/CBDs, when weed was grown in patches between property lines and not by genius-level stoners with magnifying glasses and specialized lights. But as generations of towering green buds were cultivated to get us higher and higher, the ratio fell out of balance. This lead to strains that can get you magnificently high, but for the inexperienced can lead to anxiety- the anchor of CBD having been removed, or at least not cultivated at the right ratio. For many this leads to a simplified understanding of “the weed now is too strong for me”. But we are all learning every day.</p>\n<p>I gave Kayla a small sampling of G-13, writing the name on a bottle. “Give this a try!” I said, curious to see her experience of one of the best indicas I have ever had, that I happened to have gotten from the luck of the draw. It’s funny how things line up sometimes.</p>\n<p>—</p>\n<p>For the past few days I’ve been looking for a term that reflects the Yin and Yang of upstate and the city. For me personally, happiness lies somewhere in the mixture of those things. The correct appreciation and ratio, too much of one liable to drive a person mad. Or at least me.</p>\n<p>I am looking for a name for it because I know this is not a new concept. I grew up in a town over from a former railroad town, once-booming. It became a combination of rural and commuter, home to many who took the train or masochistically drove back and forth from the city every day. Many were current or retired cops and firefighters from the city, and I have a vivid early memories of dads and coaches in my little league who were no longer around after 9/11. That and the huge new flagpole and plaque they installed near the entrance to the baseball fields.</p>\n<p>These people had grown up in the city, or at least spent their professional lives there. Cops get a unique tour through the most dramatic moments of people’s lives in any city or town. There is no need for me to reiterate the stories I have heard of dangerous pre-Giuliani New York and the wondrous delights, desperation, and gore any New York cop or firefighter must see often enough to be routine.</p>\n<p>One powerful antidote to such strong doses of the human condition that was found many generations ago is to go upstate and spend some time in the woods until the thoughts rattling around your head don’t sound so loud.</p>\n<p>What is the name for that?</p>\n<p>—</p>\n<p>One form of meditation that I have been studying (or exposed to, depending on your assessment of my discipline) is where you sit with your back straight and focus on your breath. Thoughts, as they are wont to do, cross your mind and present themselves for your indulgence. The point of this meditation is to see those thoughts say, “okay, thought”, and then let it pass and focus on your breathing. You are not suppressing or ignoring, you are acknowledging and refocusing.</p>\n<p>In the summers my mom runs a nature camp upstate. Through a state program every year a scholarship is given to a few kids in low-income neighborhoods to come upstate and stay with a family and attend a summer camp in the woods, like my mom’s. A lot of people from the city had never seen things we took for granted like pastures of cows, the strong smell of manure, and all sorts of spiders, bugs, snakes, flies, wasps, bees, and mosquitos.</p>\n<p>You learn a lot about someone when you are sitting, chatting, sipping on some juice and a bee flies on over. The way I was raised, the correct reaction is no reaction. This is true for many (but not all) encounters with wildlife. But a lot of kids, faced with this situation for the first time would scream, cover their faces, or even try to swat the bee away. Bees, unlike wasps, only get one opportunity to sting in their lives. When a bee stings you, it is their final act, a martyrdom for their queen. A bee has to kill itself to mildly annoy you, and with stakes as they are, it is much more reasonable to let it do some low-altitude flybys of your head as you remark on it’s aggressive attitude. Maybe it wants a sip of your ridiculous cup of manmade sugar that bees would be laughed out of their colonies if they suggested existed.</p>\n<p>The same is true of spiders, who are so plentiful that if you went into a fit every time you saw one you would die from exhaustion. These little lessons are repeated infinitely, hourly in the woods, but one can go their whole lives never encountering them growing up in Manhattan. The ratios and balance is all out of whack.</p>\n<p>Cities, wondrous advancements of civilization that they are, are inarguably an assault on the senses in such sustained totality that is overwhelms the human mind in ways that it did not prepare for in it’s previous life of managing a body responsible for hanging from trees and chasing bison or whatever.</p>\n<p>Time spent standing on a busy corner in midtown Manhattan needs to be offset with time sitting in the middle of a quiet forest - at a ratio I have not yet determined.</p>\n",
  "title": "Finding balance",
  "dir": "content/blog/posts",
  "base": "upstate-city-balance.json",
  "ext": ".json",
  "sourceBase": "upstate-city-balance.md",
  "sourceExt": ".md"
}
